caonam-tugraz/MultiIMU-GaitSync/firmware/slave_icm42688p/ESP32_ICM42688P_IMU.ino
#include <Wire.h>
#include <WiFi.h>
#include <esp_now.h>
#include <Preferences.h>
#include <limits.h>
#include <stdint.h>
#include <string.h>
#include <math.h>
#include "ICM42688.h"
#include "registers.h"
#include "esp_wifi.h"
#include "esp_idf_version.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/queue.h"

// ======================== CONFIG ========================
#define CHANNEL 1
#define USE_LONG_RANGE 1

#define PULSE_PIN 23
#define LED_PIN 2

#define LED_FLASH_MS 25
#define LED_RECONNECT_CYCLE 2000
#define LED_NO_MASTER_CYCLE 1500
#define NO_MASTER_THRESHOLD 120000

#define CONNECTION_TIMEOUT_MS 5000
/** Chưa có master (chưa kết nối): gửi lại HELLO tối đa mỗi khoảng này (ms). */
#define HELLO_RECONNECT_INTERVAL 3000
/** Sau N lần HELLO/kết nối thất bại liên tiếp (chưa connected) → esp_restart(). */
#define LINK_HELLO_FAIL_RESET_MAX 5U
/** Khi đã kết nối: HELLO định kỳ (ms); 0 = tắt — không spam RF / master ACK. */
#ifndef HELLO_KEEPALIVE_INTERVAL
#define HELLO_KEEPALIVE_INTERVAL 0
#endif

#define ESPNOW_SEND_WAIT_MS 250U
#ifndef ESPNOW_SYNC_SEND_WAIT_MS
#define ESPNOW_SYNC_SEND_WAIT_MS 80U
#endif

#define IMU_LOOP_PERIOD_US 10000u
/**
 * Khi đã timeSynced + IMU_SAMPLE_ALIGN_MASTER_10MS_GRID:
 * đọc IMU khi getGlobalTimeUs() % IMU_LOOP_PERIOD_US == IMU_SAMPLE_GRID_PHASE_US.
 * 0 = đúng biên lưới (mốc chia hết cho 10 ms), giống slave BNO055.
 * Khi chưa sync: vẫn vTaskDelayUntil 10 ms (pha ngẫu nhiên giữa các slave).
 */
#ifndef IMU_SAMPLE_ALIGN_MASTER_10MS_GRID
#define IMU_SAMPLE_ALIGN_MASTER_10MS_GRID 1
#endif
#if IMU_SAMPLE_ALIGN_MASTER_10MS_GRID
#ifndef IMU_SAMPLE_GRID_PHASE_US
#define IMU_SAMPLE_GRID_PHASE_US 0u
#endif
#if IMU_SAMPLE_GRID_PHASE_US >= IMU_LOOP_PERIOD_US
#error IMU_SAMPLE_GRID_PHASE_US must be < IMU_LOOP_PERIOD_US
#endif
#endif
/**
 * 1 = task FreeRTOS đọc IMU ~100 Hz; loop chỉ gửi queue ESP-NOW/SYNC (không chặn lấy mẫu).
 * 0 = đọc IMU trong loop() + delay cuối vòng.
 */
#ifndef ENABLE_IMU_DEDICATED_TASK
#define ENABLE_IMU_DEDICATED_TASK 1
#endif
#if ENABLE_IMU_DEDICATED_TASK
#define IMU_SAMPLE_TASK_STACK 8192
#define IMU_SAMPLE_TASK_PRIO 5
#define IMU_BATCH_QUEUE_DEPTH 8
/** Core 0: tách SPI khỏi loop Arduino (thường core 1) + WiFi. */
#define IMU_SAMPLE_TASK_CORE 0
#endif
/** Số lần gọi lại getAGT() ngay khi lỗi (thêm 2 → tối đa 3 lần đọc/mẫu). */
#define IMU_GET_AGT_RETRY_EXTRA 2
#define ENABLE_WIFI_SEND 1
#define SERIAL_IMU_OUTPUT 0
/**
 * 0 = slave tự gửi SYNC (định kỳ + sau lỗi RF) — mặc định gốc.
 * 1 = chỉ đồng bộ khi Master gửi TSRQ.
 */
#ifndef SLAVE_SYNC_MASTER_DRIVEN
#define SLAVE_SYNC_MASTER_DRIVEN 0
#endif

/** 1 = in slot IMU/SYNC khi nhận gói Master (dễ spam Serial). */
#ifndef DEBUG_IMU_SLOT_SERIAL
#define DEBUG_IMU_SLOT_SERIAL 0
#endif

/**
 * RSSI nhận từ master < ngưỡng: đệm lô IMU_RAWB; service gửi tối đa SLAVE_IMU_LOW_RSSI_SENDS lần
 * cách SLAVE_IMU_LOW_RSSI_SEND_GAP_MS, dừng khi OK (không chặn loop — millis + loop).
 */
#ifndef SLAVE_IMU_LOW_RSSI_DB
#define SLAVE_IMU_LOW_RSSI_DB (-68)
#endif
/** RSSI thấp: vẫn SYNC nếu RTT < SYNC_ACCEPT_MAX_RTT_US; 1 = chặn SYNC khi RSSI < ngưỡng. */
#ifndef SLAVE_SYNC_RSSI_GATE
#define SLAVE_SYNC_RSSI_GATE 0
#endif
#ifndef SLAVE_SYNC_MIN_RSSI_DB
#define SLAVE_SYNC_MIN_RSSI_DB (-80)
#endif
#ifndef SLAVE_IMU_LOW_RSSI_SENDS
#define SLAVE_IMU_LOW_RSSI_SENDS 2U
#endif
#ifndef SLAVE_IMU_LOW_RSSI_SEND_GAP_MS
#define SLAVE_IMU_LOW_RSSI_SEND_GAP_MS 10U
#endif
#ifndef SLAVE_IMU_LOW_RSSI_QUEUE_CAP
#define SLAVE_IMU_LOW_RSSI_QUEUE_CAP 8U
#endif

/**
 * Công suất phát WiFi (esp_wifi_set_max_tx_power, đơn vị 0,25 dBm).
 * Mặc định khởi động ở max (84 ≈ 21 dBm); thu: WIFI_PS_NONE (không sleep).
 */
#ifndef SLAVE_WIFI_TX_POWER_MAX_QDB
#define SLAVE_WIFI_TX_POWER_MAX_QDB 84
#endif
#ifndef SLAVE_WIFI_TX_POWER_ADAPTIVE
#define SLAVE_WIFI_TX_POWER_ADAPTIVE 0
#endif
#ifndef SLAVE_WIFI_TX_POWER_NORM_QDB
#define SLAVE_WIFI_TX_POWER_NORM_QDB SLAVE_WIFI_TX_POWER_MAX_QDB
#endif
#ifndef SLAVE_WIFI_TX_POWER_BOOST_QDB
#define SLAVE_WIFI_TX_POWER_BOOST_QDB SLAVE_WIFI_TX_POWER_MAX_QDB
#endif
#ifndef SLAVE_WIFI_TX_RSSI_BOOST_DB
#define SLAVE_WIFI_TX_RSSI_BOOST_DB SLAVE_IMU_LOW_RSSI_DB
#endif
#ifndef SLAVE_WIFI_TX_RSSI_RESTORE_DB
#define SLAVE_WIFI_TX_RSSI_RESTORE_DB (-65)
#endif
#ifndef SLAVE_WIFI_TX_POWER_ADJ_INTERVAL_MS
#define SLAVE_WIFI_TX_POWER_ADJ_INTERVAL_MS 2000U
#endif

// 42688 
#define SDA_PIN 4
#define SCL_PIN 16

// GY601N
// #define SDA_PIN 4
// #define SCL_PIN 5


#define ICM42688_ADDR 0x69

#define IMU_ACCEL_FS ICM42688::gpm8
#define IMU_GYRO_FS ICM42688::dps2000
#define IMU_ACCEL_ODR ICM42688::odr100
#define IMU_GYRO_ODR ICM42688::odr100

#define ACC_G_TO_MSS 9.80665f

// Gói IMU ESP-NOW: int16 thô (khớp imu_serial_codec.py trên PC)
#define IMU_RAW_ACC_SCALE 512.0f
// Gyro °/s → int16: cần scale ≤ 32767/FS_dps hoặc sẽ bão hòa sớm (vd. 100 → chỉ ~±328 °/s).
// Đặt FS_dps trùng với IMU_GYRO_FS (vd. dps2000 → 2000).
#define IMU_GYRO_FS_DPS 2000.0f
#define IMU_RAW_GYRO_SCALE (32767.0f / IMU_GYRO_FS_DPS)
/** Nhiệt độ die (°C) → int16 trên không trùng: ×100 (0,01 °C/LSB) */
#define IMU_TEMP_CENTI_SCALE 100.0f
/** ICM42688 không có từ kế: luôn gửi 0 cho mx/my/mz (cùng khung với slave có MAG). */
#define IMU_MAG_INT16_NONE 0

// ---- SYNC CONFIG ----
/** Chu kỳ đồng bộ định kỳ khi đã ổn định (ms) = 30 s + MAC slot; trùng chu kỳ fold drift. */
#define SYNC_INTERVAL_MS 30000UL
/** Mặc định dùng ngay SYNC_INTERVAL_MS (không ramp). Muốn ramp: đặt START nhỏ hơn MAX, STEP > 0. */
#ifndef SYNC_INTERVAL_START_MS
#define SYNC_INTERVAL_START_MS SYNC_INTERVAL_MS
#endif
#ifndef SYNC_INTERVAL_STEP_MS
#define SYNC_INTERVAL_STEP_MS 0U
#endif
/** Đã từng có lastSyncTime nhưng cần mở lại vòng SYNC: chờ tối thiểu (ms) giữa các lần thử. */
#define SYNC_RETRY_AFTER_FAIL_MS 3000U
/** RTT (µs) dưới ngưỡng này → chấp nhận offset ngay; >= ngưỡng → bỏ qua mẫu. */
#define SYNC_ACCEPT_MAX_RTT_US 4000LL
#define SYNC_SAMPLE_GAP_MS 20
#ifndef SYNC_FAIL_BACKOFF_GAP_MS
#define SYNC_FAIL_BACKOFF_GAP_MS 100U
#endif
#ifndef IMU_TX_FAIL_RESYNC_AFTER
#define IMU_TX_FAIL_RESYNC_AFTER 3U
#endif
#ifndef IMU_TX_FAIL_RETRY_GAP_MS
#define IMU_TX_FAIL_RETRY_GAP_MS 50U
#endif
#define SYNC_PERIODIC_MAC_SLOT_DIVISOR 25U
#define SYNC_PERIODIC_SLOT_SPACING_MS 200UL
#define SYNC_PERIODIC_SLOT_WINDOW_MS 50UL
#define SYNC_PERIODIC_MAX_OFFSET_MS \
  ((255U / SYNC_PERIODIC_MAC_SLOT_DIVISOR) * SYNC_PERIODIC_SLOT_SPACING_MS)
/** Drift từ thay đổi median offset giữa các vòng SYNC_DONE. */
#define SYNC_DRIFT_MIN_SPAN_US 10000000ULL
#define SYNC_DRIFT_MAX_ABS_PPM 60.0
#define SYNC_DRIFT_FILTER_ALPHA 0.10
#ifndef SYNC_DRIFT_COMP_ENABLE
#define SYNC_DRIFT_COMP_ENABLE 1
#endif
/** Gộp drift tích lũy vào globalTimeOffset (cùng chu kỳ SYNC_INTERVAL_MS). */
#define SYNC_DRIFT_COMP_INTERVAL_MS SYNC_INTERVAL_MS
#define SYNC_DRIFT_COMP_MIN_ACCEPTED 3U
#define SYNC_DRIFT_NVS_HISTORY_N 5U
#define SYNC_DRIFT_NVS_STD_MAX_PPM 5.0
#define SYNC_DRIFT_NVS_SAVE_DELTA_PPM 1.0
#define SYNC_DRIFT_NVS_SAVE_INTERVAL_MS 600000UL

