caonam-tugraz/MultiIMU-GaitSync/firmware/slave_icm42688p/ESP32_ICM42688P_IMU.ino
#define VBAT_ADC_PIN 34
/** Trung bình trượt N mẫu; tần số lấy mẫu ADC = 1000/VBAT_ADC_SAMPLE_PERIOD_MS (Hz). */
#define VBAT_ADC_MA_N 10
#define VBAT_ADC_SAMPLE_PERIOD_MS 500UL
/** Khớp Master TFT: % pin từ cell (3.2V…4.1V), raw 12-bit chân chia áp. */
#define VBAT_CELL_FULL_V 4.1f
#define VBAT_CELL_EMPTY_V 3.2f
#define VBAT_ADC_PIN_VCELL_SCALE 0.496f
#define VBAT_ADC_PIN_AT_CELL_FULL_V (VBAT_CELL_FULL_V * VBAT_ADC_PIN_VCELL_SCALE)
#define VBAT_ADC_REF_V 3.3f
#define VBAT_VCELL_PER_VADC (VBAT_CELL_FULL_V / VBAT_ADC_PIN_AT_CELL_FULL_V)
/** Pin < 10%: tắt WiFi, dừng IMU, LED D2 nhấp 2s tắt / 0.2s sáng. */
#define VBAT_LOW_PCT_ENTER 10
#define VBAT_LOW_LED_OFF_MS 2000UL
#define VBAT_LOW_LED_CYCLE_MS (VBAT_LOW_LED_OFF_MS + 200UL)

ICM42688 IMU(Wire, ICM42688_ADDR);
Preferences prefs;

// ======================== PACKETS ========================
typedef struct {
  char type[8];
  uint8_t mac[6];
  uint32_t node_id;
  uint32_t timestamp;
  uint64_t micros_timestamp;
  int timezone_offset;
  uint64_t request_time;
  uint64_t response_time;
  uint16_t slave_adc_raw;
  uint32_t last_sync_rtt_us;
  uint8_t imu_tx_slot;
  uint8_t sync_slot;
  uint8_t imu_tx_slot_count;
  uint8_t slot_flags;
} packet_t;

#define MASTER_IMU_TX_SLOT_COUNT 10U
#define MASTER_SYNC_SLOT_COUNT 11U
#define MASTER_SLOT_UNASSIGNED 0xFFU
#define PACKET_T_SLOT_FLAG_VALID 0x01U
#define PACKET_T_LEGACY_SIZE ((size_t)offsetof(packet_t, imu_tx_slot))

// Gói IMU tối giản (packed): micros + sample_seq + accel/gyro int16 — MAG = IMU_MAG_INT16_NONE.
#pragma pack(push, 1)
typedef struct {
  char type[8];
  uint8_t mac[6];
  uint32_t node_id;
  uint64_t micros_timestamp;
  uint32_t sample_seq;
  int16_t ax, ay, az, gx, gy, gz;
  int16_t mx, my, mz;
  int16_t temp_centi_c;
} imu_packet_raw_t;

#define IMU_BATCH_MAX_SAMPLES 15
typedef struct {
  uint16_t delta_us_from_prev;
  int16_t ax, ay, az, gx, gy, gz;
  int16_t mx, my, mz;
} imu_batch_delta_t;

typedef struct {
  char type[8];
  uint8_t mac[6];
  uint32_t node_id;
  uint8_t count;
  uint8_t reserved[3];
  uint32_t sample_seq0;
  uint64_t micros_t0;
  int16_t ax0, ay0, az0, gx0, gy0, gz0;
  int16_t mx0, my0, mz0;
  int16_t temp_centi_c;
  imu_batch_delta_t rest[IMU_BATCH_MAX_SAMPLES - 1];
} imu_batch_packet_t;
#pragma pack(pop)

#define IMU_BATCH_HEADER_SIZE 54
// Số mẫu IMU gộp mỗi gói ESP-NOW (100 Hz / 5 = 20 gói/s).
#define IMU_BATCH_SAMPLES 5
/** Mất kết nối tạm thời: ~600 mẫu (~6 s @ ~100 Hz). */
#define IMU_OFFLINE_BUFFER_SAMPLES 600
#define IMU_OFFLINE_BATCH_CAP (IMU_OFFLINE_BUFFER_SAMPLES / IMU_BATCH_SAMPLES)

/** TDMA mềm (nhiều slave): slot_index = (MAC[4] | MAC[5]<<8) % N; thời điểm theo getGlobalTimeUs() sau SYNC (không trôi). */
#ifndef ENABLE_IMU_TX_SLOT
#define ENABLE_IMU_TX_SLOT 1
#endif
#if ENABLE_IMU_TX_SLOT
#define IMU_TX_SLOT_COUNT 10
/** 10 × 5000 µs = 50 ms một khung TDMA. */
#define IMU_TX_SLOT_US 5000u
/** Chờ tối đa trong slot 5 ms; hết ngưỡng vẫn gửi (có thể lệch TDMA nhẹ). */
#define IMU_TX_SLOT_MAX_SPIN_US 2000u
#endif

typedef struct {
  char type[8];
  uint8_t mac[6];
  uint32_t node_id;
  uint32_t timestamp;
  uint64_t micros_timestamp;
  float bias[3];
  float scale[3];
  float global_scale;
  uint8_t save_to_nvs;
  uint8_t enabled;
  uint8_t reserved[2];
  float gyro_bias[3];
} accel_calib_packet_t;

#ifndef ACCEL_CALIB_PACKET_LEGACY_SIZE
#define ACCEL_CALIB_PACKET_LEGACY_SIZE 64
#endif

/** Master → Slave: yêu cầu gửi lại mẫu theo dải sample_seq (khớp master esp_now_time_sync). */
#pragma pack(push, 1)
typedef struct {
  char type[8];
  uint8_t target_mac[6];
  uint32_t node_id;
  uint32_t seq_first;
  uint32_t seq_count;
} imu_lost_request_t;
#pragma pack(pop)
#define IMU_LOST_REQUEST_SIZE 26U

/** ~100 Hz retx (~7,7 s); 768 thay 896 để offline 600 mẫu vừa DRAM ESP32. */
#define IMU_RETX_RING_CAP 768U
typedef struct {
  uint32_t seq;
  uint64_t micros;
  int16_t ax, ay, az, gx, gy, gz;
  int16_t mx, my, mz;
  int16_t temp_centi_c;
} imu_retx_slot_t;
static imu_retx_slot_t imuRetxRing[IMU_RETX_RING_CAP];

// ======================== MASTER MAC (đồng bộ BNO055 slave + ICM) ========================
// Cũ (TFT master): 3C:E9:0E:B3:FA:C0
// uint8_t masterMAC[6] = {0x3C, 0xE9, 0x0E, 0xB3, 0xFA, 0xC0};
uint8_t masterMAC[6] = {0xE4, 0x65, 0xB8, 0xE6, 0x79, 0xE4};

// ======================== STATE ========================
volatile bool connected = false;
bool hasEverConnected = false;
volatile bool timeSynced = false;

unsigned long lastHelloTime = 0;
volatile unsigned long lastAckTime = 0;
unsigned long ledOffAt = 0;
unsigned long disconnectedSince = 0;
unsigned long lastSyncTime = 0;
static uint32_t syncPeriodicIntervalMs = SYNC_INTERVAL_START_MS;
unsigned int imuPacketCount = 0;
uint32_t imuSampleSeq = 0;
bool imuReadErrorPrinted = false;

#if ENABLE_WIFI_SEND
static bool imuOfflineCaptureMode = false;
#endif

// ---- time sync state ----
int64_t globalTimeOffset = 0;
int64_t globalTimeOffsetTarget = 0;
int64_t networkDelayUs = 0;
int timezoneOffset = 0;

bool syncRunning = false;
unsigned long lastSyncSampleSentMs = 0;

/** Debug drift ổn định hơn: dùng thay đổi median offset giữa các vòng SYNC_DONE. */
static uint64_t syncPrevDriftLocalUs = 0;
static int64_t syncPrevDriftOffsetUs = 0;
static bool syncPrevDriftSampleValid = false;
static double syncDriftFilteredPpm = 0.0;
static bool syncDriftFilteredValid = false;
static uint8_t syncDriftAcceptedCount = 0;
static uint64_t syncDriftAnchorLocalUs = 0;
static unsigned long syncDriftLastCompMs = 0;
static double syncDriftRecentPpm[SYNC_DRIFT_NVS_HISTORY_N] = {0.0};
static uint8_t syncDriftRecentCount = 0;
static uint8_t syncDriftRecentNext = 0;
static float syncDriftLastSavedPpm = 0.0f;
static bool syncDriftLastSavedValid = false;
static uint32_t syncDriftLastSaveMs = 0;

/** Gửi trong gói SYNC tới: RTT trung vị vòng đồng bộ trước — khớp BNO055 / Master. */
uint32_t lastCompletedSyncBestRttUs = 0;

/**
 * Luôn bật đường hiệu chỉnh accel: acc_c = (raw - bias) * scale * global_scale.
 * Mặc định / sau CLRCAL: bias=0, scale=1, global_scale=1 → acc_c ≈ raw (trung tính).
 */
bool accelCalibEnabled = true;
float accelBias[3] = {0.0f, 0.0f, 0.0f};
float accelScale[3] = {1.0f, 1.0f, 1.0f};
float accelGlobalScale = 1.0f;
/** Bù offset gyro (°/s), trừ sau khi đọc chip — trước khi scale int16. */
float gyroBias[3] = {0.0f, 0.0f, 0.0f};

#if ENABLE_WIFI_SEND
/** 0 = chờ callback, 1 = ESP_NOW_SEND_SUCCESS, 2 = fail/timeout */
volatile uint8_t espnowTxResult = 0;
static uint8_t imuTxFailStreak = 0;
static bool syncLastSendOk = true;
static uint32_t imuTxNextAttemptMs = 0;
static uint8_t helloConnectFailCount = 0;
#endif
/** Cập nhật trong onDataRecv (rx_ctrl); dùng cho chính sách gửi IMU khi RSSI thấp. */
volatile int8_t g_slaveLastRxRssiDb = 0;
volatile uint8_t g_slaveLastRxRssiValid = 0;

#if ENABLE_IMU_DEDICATED_TASK
static QueueHandle_t imuBatchTxQueue = NULL;
static TaskHandle_t imuSampleTaskHandle = NULL;
#endif

static bool lowBatteryCrit = false;

static void syncDriftRecentAdd(double ppm);
static void maybeSaveStableSyncDriftToNvs(void);
static bool syncDriftCompActive(void);
static int64_t syncDriftCorrectionUs(uint64_t tNow);
static void syncDriftFoldPendingIntoOffset(uint64_t tNow, bool log);
static void syncDriftPeriodicService(void);

// ======================== UTIL ========================
uint64_t nowUs() {
  return (uint64_t)esp_timer_get_time();
}

