caonam-tugraz/MultiIMU-GaitSync/firmware/slave_icm42688p/ESP32_ICM42688P_IMU.ino
uint32_t nowMs() {
  return (uint32_t)(nowUs() / 1000ULL);
}

static uint16_t vbatMaBuf[VBAT_ADC_MA_N];
static uint8_t vbatMaNext = 0;
static uint8_t vbatMaCount = 0;
static unsigned long vbatMaLastPollMs = 0;

/** Gọi mỗi vòng loop: thêm 1 mẫu ADC vào buffer (chu kỳ VBAT_ADC_SAMPLE_PERIOD_MS). */
static void vbatAdcPoll() {
  unsigned long ms = millis();
  if (vbatMaLastPollMs != 0 &&
      (unsigned long)(ms - vbatMaLastPollMs) < VBAT_ADC_SAMPLE_PERIOD_MS) {
    return;
  }
  vbatMaLastPollMs = ms;
  vbatMaBuf[vbatMaNext] = (uint16_t)analogRead(VBAT_ADC_PIN);
  vbatMaNext = (uint8_t)((vbatMaNext + 1) % VBAT_ADC_MA_N);
  if (vbatMaCount < VBAT_ADC_MA_N) {
    vbatMaCount++;
  }
}

/** Trung bình N mẫu cuối (moving average). */
static uint16_t readVbatAdcRaw() {
  if (vbatMaCount == 0) {
    return (uint16_t)analogRead(VBAT_ADC_PIN);
  }
  uint32_t sum = 0;
  if (vbatMaCount < VBAT_ADC_MA_N) {
    for (uint8_t i = 0; i < vbatMaCount; i++) {
      sum += vbatMaBuf[i];
    }
    return (uint16_t)((sum + vbatMaCount / 2) / vbatMaCount);
  }
  for (uint8_t i = 0; i < VBAT_ADC_MA_N; i++) {
    sum += vbatMaBuf[(vbatMaNext + i) % VBAT_ADC_MA_N];
  }
  return (uint16_t)((sum + VBAT_ADC_MA_N / 2) / VBAT_ADC_MA_N);
}

static float adcRawToVadcPin(uint16_t raw12) {
  return (float)raw12 * (VBAT_ADC_REF_V / 4095.0f);
}

static float adcRawToVcellEst(uint16_t raw12) {
  return adcRawToVadcPin(raw12) * VBAT_VCELL_PER_VADC;
}

static uint8_t adcRawToBatteryPct(uint16_t raw12) {
  const float Vcell = adcRawToVcellEst(raw12);
  if (Vcell >= VBAT_CELL_FULL_V) {
    return 100;
  }
  if (Vcell <= VBAT_CELL_EMPTY_V) {
    return 0;
  }
  float pct =
      (Vcell - VBAT_CELL_EMPTY_V) / (VBAT_CELL_FULL_V - VBAT_CELL_EMPTY_V) * 100.0f;
  if (pct > 100.0f) {
    pct = 100.0f;
  }
  if (pct < 0.0f) {
    pct = 0.0f;
  }
  return (uint8_t)(pct + 0.5f);
}

static void enterLowBatteryCritMode(void) {
  if (lowBatteryCrit) {
    return;
  }
  lowBatteryCrit = true;
  ledOffAt = 0;
  Serial.println("LOW BAT <10%: stop IMU, WiFi off, LED blink 2s/0.2s");
#if ENABLE_IMU_DEDICATED_TASK
  if (imuSampleTaskHandle != NULL) {
    vTaskSuspend(imuSampleTaskHandle);
  }
#endif
  digitalWrite(PULSE_PIN, LOW);
  digitalWrite(LED_PIN, LOW);
  esp_now_deinit();
  WiFi.disconnect(true, true);
  WiFi.mode(WIFI_OFF);
  connected = false;
  hasEverConnected = false;
}

static bool syncDriftCompActive(void) {
#if SYNC_DRIFT_COMP_ENABLE
  return syncDriftFilteredValid &&
         syncDriftAcceptedCount >= (uint8_t)SYNC_DRIFT_COMP_MIN_ACCEPTED;
#else
  return false;
#endif
}

static int64_t syncDriftCorrectionUs(uint64_t tNow) {
#if SYNC_DRIFT_COMP_ENABLE
  if (!syncDriftCompActive() || syncDriftAnchorLocalUs == 0ULL ||
      tNow < syncDriftAnchorLocalUs) {
    return 0;
  }
  const uint64_t elapsed = tNow - syncDriftAnchorLocalUs;
  return (int64_t)((double)elapsed * syncDriftFilteredPpm / 1000000.0);
#else
  (void)tNow;
  return 0;
#endif
}

static void syncDriftFoldPendingIntoOffset(uint64_t tNow, bool log) {
#if SYNC_DRIFT_COMP_ENABLE
  if (!syncDriftCompActive() || syncDriftAnchorLocalUs == 0ULL ||
      tNow < syncDriftAnchorLocalUs) {
    return;
  }
  const int64_t delta = syncDriftCorrectionUs(tNow);
  if (delta == 0) {
    return;
  }
  globalTimeOffset += delta;
  globalTimeOffsetTarget = globalTimeOffset;
  syncDriftAnchorLocalUs = tNow;
  if (log) {
    Serial.printf(
        "DRIFT_COMP fold=%lld us ppm=%.3f offset=%lld us anchor=%llu us\n",
        (long long)delta, syncDriftFilteredPpm, (long long)globalTimeOffset,
        (unsigned long long)tNow);
  }
#else
  (void)tNow;
  (void)log;
#endif
}

static void syncDriftPeriodicService(void) {
#if SYNC_DRIFT_COMP_ENABLE
  if (!timeSynced || !syncDriftCompActive()) {
    return;
  }
  const unsigned long nowMs = millis();
  if (syncDriftLastCompMs != 0U &&
      (unsigned long)(nowMs - syncDriftLastCompMs) <
          (unsigned long)SYNC_DRIFT_COMP_INTERVAL_MS) {
    return;
  }
  syncDriftFoldPendingIntoOffset(nowUs(), true);
  syncDriftLastCompMs = nowMs;
#endif
}

int64_t getGlobalTimeUs() {
  int64_t t = (int64_t)nowUs();
  if (timeSynced) {
    return t + globalTimeOffset + syncDriftCorrectionUs((uint64_t)t);
  }
  return t;
}

#if ENABLE_WIFI_SEND
static bool imuOfflineCaptureActive(void);
static void imuOfflineCaptureEndOnReconnect(void);
#else
static bool imuOfflineCaptureActive(void);
#endif

static void touchMasterLink(void) {
  lastAckTime = millis();
  connected = true;
#if ENABLE_WIFI_SEND
  helloConnectFailCount = 0;
  imuOfflineCaptureEndOnReconnect();
#endif
  hasEverConnected = true;
  if (disconnectedSince != 0) {
    disconnectedSince = 0;
  }
}

/** Đọc sensor ~100 Hz khi còn link hoặc đang ghi đệm offline sau mất link. */
static bool imuSampleAllowed(void) {
  if (imuOfflineCaptureActive()) {
    return true;
  }
  if (!connected) {
    return false;
  }
  const unsigned long lastAck = lastAckTime;
  if (lastAck == 0UL ||
      (unsigned long)(millis() - lastAck) > CONNECTION_TIMEOUT_MS) {
    return false;
  }
  return true;
}

/** Đóng gói / gửi IMU_RAWB chỉ khi đã SYNC, link OK và không đang vòng SYNC. */
static bool imuStreamReady(void) {
  return imuSampleAllowed() && timeSynced && !syncRunning;
}

/** Micros ghi cho mẫu IMU: mốc trigger ngay trước khi bắt đầu đọc sensor. */
static uint64_t imuTimestampForSampleLoggedUs(void) {
  int64_t t = getGlobalTimeUs();
  return (uint64_t)((t < 0) ? 0 : t);
}

void printMAC(const uint8_t *mac) {
  for (int i = 0; i < 6; i++) {
    Serial.printf("%02X", mac[i]);
    if (i < 5) Serial.print(":");
  }
}

void printTime() {
  uint64_t localUs = nowUs();

  if (timeSynced) {
    int64_t adjustedUs = getGlobalTimeUs();
    uint32_t adjustedMs = (uint32_t)(adjustedUs / 1000LL);

    int hours = (adjustedMs / 3600000UL) % 24;
    int minutes = (adjustedMs / 60000UL) % 60;
    int seconds = (adjustedMs / 1000UL) % 60;
    int milliseconds = adjustedMs % 1000UL;

    Serial.printf("TIME %02d:%02d:%02d.%03d (synced)\n",
                  hours, minutes, seconds, milliseconds);
  } else {
    uint32_t localMs = (uint32_t)(localUs / 1000ULL);

    int hours = (localMs / 3600000UL) % 24;
    int minutes = (localMs / 60000UL) % 60;
    int seconds = (localMs / 1000UL) % 60;
    int milliseconds = localMs % 1000UL;

    Serial.printf("TIME %02d:%02d:%02d.%03d (local - not synced)\n",
                  hours, minutes, seconds, milliseconds);
  }
}

void applyAccelCalibration(float &ax, float &ay, float &az) {
  ax = (ax - accelBias[0]) * accelScale[0] * accelGlobalScale;
  ay = (ay - accelBias[1]) * accelScale[1] * accelGlobalScale;
  az = (az - accelBias[2]) * accelScale[2] * accelGlobalScale;
}

static void applyGyroCalibration(float &gx, float &gy, float &gz) {
  gx -= gyroBias[0];
  gy -= gyroBias[1];
  gz -= gyroBias[2];
}

