caonam-tugraz/MultiIMU-GaitSync/firmware/slave_icm42688p/ESP32_ICM42688P_IMU.ino
/** Đặt lại hệ số identity; chế độ hiệu chỉnh accel vẫn BẬT; gyro bias về 0. */
void resetAccelCalibration() {
  accelCalibEnabled = true;
  accelBias[0] = accelBias[1] = accelBias[2] = 0.0f;
  accelScale[0] = accelScale[1] = accelScale[2] = 1.0f;
  accelGlobalScale = 1.0f;
  gyroBias[0] = gyroBias[1] = gyroBias[2] = 0.0f;
}

bool saveAccelCalibrationToNvs() {
  bool ok = prefs.begin("imu_calib", false);
  if (!ok) {
    return false;
  }
  prefs.putBool("enabled", true);
  prefs.putBytes("bias", accelBias, sizeof(accelBias));
  prefs.putBytes("scale", accelScale, sizeof(accelScale));
  prefs.putFloat("gscale", accelGlobalScale);
  prefs.putBytes("gyro_bias", gyroBias, sizeof(gyroBias));
  prefs.end();
  return true;
}

void loadAccelCalibrationFromNvs() {
  bool ok = prefs.begin("imu_calib", true);
  if (!ok) {
    Serial.println("CALIB_LOAD,FAIL,open");
    return;
  }

  size_t biasLen = prefs.getBytesLength("bias");
  size_t scaleLen = prefs.getBytesLength("scale");
  if (biasLen == sizeof(accelBias)) {
    prefs.getBytes("bias", accelBias, sizeof(accelBias));
  } else {
    accelBias[0] = accelBias[1] = accelBias[2] = 0.0f;
  }

  if (scaleLen == sizeof(accelScale)) {
    prefs.getBytes("scale", accelScale, sizeof(accelScale));
  } else {
    accelScale[0] = accelScale[1] = accelScale[2] = 1.0f;
  }

  accelGlobalScale = prefs.getFloat("gscale", 1.0f);

  size_t gbLen = prefs.getBytesLength("gyro_bias");
  if (gbLen == sizeof(gyroBias)) {
    prefs.getBytes("gyro_bias", gyroBias, sizeof(gyroBias));
  } else {
    gyroBias[0] = gyroBias[1] = gyroBias[2] = 0.0f;
  }

  prefs.end();

  accelCalibEnabled = true;

  Serial.printf(
      "CALIB_LOAD,%s,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f\n",
      accelCalibEnabled ? "ENABLED" : "DISABLED",
      accelBias[0], accelBias[1], accelBias[2],
      accelScale[0], accelScale[1], accelScale[2],
      accelGlobalScale,
      gyroBias[0], gyroBias[1], gyroBias[2]);
}

static void syncDriftRecentReset(void) {
  syncDriftRecentCount = 0;
  syncDriftRecentNext = 0;
}

static void syncDriftRecentAdd(double ppm) {
  syncDriftRecentPpm[syncDriftRecentNext] = ppm;
  syncDriftRecentNext =
      (uint8_t)((syncDriftRecentNext + 1U) % (uint8_t)SYNC_DRIFT_NVS_HISTORY_N);
  if (syncDriftRecentCount < (uint8_t)SYNC_DRIFT_NVS_HISTORY_N) {
    syncDriftRecentCount++;
  }
}

static bool syncDriftRecentStats(double &meanPpm, double &stdPpm) {
  if (syncDriftRecentCount < (uint8_t)SYNC_DRIFT_NVS_HISTORY_N) {
    return false;
  }
  double sum = 0.0;
  for (uint8_t i = 0; i < syncDriftRecentCount; i++) {
    sum += syncDriftRecentPpm[i];
  }
  meanPpm = sum / (double)syncDriftRecentCount;
  double var = 0.0;
  for (uint8_t i = 0; i < syncDriftRecentCount; i++) {
    const double d = syncDriftRecentPpm[i] - meanPpm;
    var += d * d;
  }
  stdPpm = sqrt(var / (double)syncDriftRecentCount);
  return true;
}

static void loadSyncDriftFromNvs(void) {
  bool ok = prefs.begin("sync_drift", true);
  if (!ok) {
    Serial.println("DRIFT_LOAD,FAIL,open");
    return;
  }
  const bool valid = prefs.getBool("valid", false);
  const float ppm = prefs.getFloat("ppm", 0.0f);
  prefs.end();
  if (valid && isfinite(ppm) && fabs((double)ppm) <= SYNC_DRIFT_MAX_ABS_PPM) {
    syncDriftFilteredPpm = (double)ppm;
    syncDriftFilteredValid = true;
    syncDriftAcceptedCount = (uint8_t)SYNC_DRIFT_COMP_MIN_ACCEPTED;
    syncDriftLastSavedPpm = ppm;
    syncDriftLastSavedValid = true;
    Serial.printf("DRIFT_LOAD,OK,ppm=%.3f (used as initial prior)\n", (double)ppm);
  } else {
    Serial.printf("DRIFT_LOAD,NONE,valid=%d,ppm=%.3f\n", valid ? 1 : 0, (double)ppm);
  }
}

static bool saveSyncDriftToNvs(float ppm, double meanPpm, double stdPpm) {
  bool ok = prefs.begin("sync_drift", false);
  if (!ok) {
    Serial.println("DRIFT_SAVE,FAIL,open");
    return false;
  }
  prefs.putBool("valid", true);
  prefs.putFloat("ppm", ppm);
  prefs.end();
  syncDriftLastSavedPpm = ppm;
  syncDriftLastSavedValid = true;
  syncDriftLastSaveMs = millis();
  Serial.printf("DRIFT_SAVE,OK,ppm=%.3f,mean5=%.3f,std5=%.3f\n",
                (double)ppm, meanPpm, stdPpm);
  return true;
}

static void maybeSaveStableSyncDriftToNvs(void) {
  double meanPpm = 0.0;
  double stdPpm = 0.0;
  if (!syncDriftRecentStats(meanPpm, stdPpm)) {
    return;
  }
  if (stdPpm > SYNC_DRIFT_NVS_STD_MAX_PPM) {
    return;
  }
  if (!syncDriftFilteredValid) {
    return;
  }
  if (syncDriftLastSaveMs != 0U &&
      (uint32_t)(millis() - syncDriftLastSaveMs) <
          (uint32_t)SYNC_DRIFT_NVS_SAVE_INTERVAL_MS) {
    return;
  }
  const float ppmToSave = (float)meanPpm;
  if (syncDriftLastSavedValid &&
      fabs((double)ppmToSave - (double)syncDriftLastSavedPpm) <
          SYNC_DRIFT_NVS_SAVE_DELTA_PPM) {
    return;
  }
  (void)saveSyncDriftToNvs(ppmToSave, meanPpm, stdPpm);
}

void sendCalibAck(bool success) {
  packet_t pkt = {};
  strcpy(pkt.type, success ? "CACK" : "CERR");
#if ESP_IDF_VERSION_MAJOR >= 5
  esp_wifi_get_mac(WIFI_IF_STA, pkt.mac);
#else
  esp_read_mac(pkt.mac, ESP_MAC_WIFI_STA);
#endif
  pkt.node_id = (uint32_t)(ESP.getEfuseMac() & 0xFFFFFF);
  pkt.timestamp = nowMs();
  pkt.micros_timestamp = nowUs();
  pkt.timezone_offset = timezoneOffset;
  pkt.request_time = 0;
  pkt.response_time = 0;
  pkt.slave_adc_raw = 0;
  pkt.last_sync_rtt_us = 0;
#if ENABLE_WIFI_SEND
  /* Không dùng retry+callback chờ ở đây: onDataRecv có thể gọi khi đang chờ TX khác. */
  esp_now_send(masterMAC, (uint8_t *)&pkt, sizeof(pkt));
#endif
}

bool readImuSample(float &ax, float &ay, float &az,
                   float &gx, float &gy, float &gz, float &temp_c) {
  int status = -1;
  const int kAttempts = 1 + IMU_GET_AGT_RETRY_EXTRA;
  for (int attempt = 0; attempt < kAttempts; attempt++) {
    status = IMU.getAGT();
    if (status >= 0) {
      break;
    }
    if (attempt + 1 < kAttempts) {
      delayMicroseconds(500);
    }
  }
  if (status < 0) {
    if (!imuReadErrorPrinted) {
      Serial.printf("IMU_READ_ERROR,%d\n", status);
      imuReadErrorPrinted = true;
    }
    return false;
  }

