caonam-tugraz/MultiIMU-GaitSync/firmware/slave_icm42688p/ESP32_ICM42688P_IMU.ino
  imuReadErrorPrinted = false;

  ax = IMU.accX() * ACC_G_TO_MSS;
  ay = IMU.accY() * ACC_G_TO_MSS;
  az = IMU.accZ() * ACC_G_TO_MSS;

  gx = IMU.gyrX();
  gy = IMU.gyrY();
  gz = IMU.gyrZ();
  temp_c = IMU.temp();

  return true;
}

static inline int16_t imu_float_to_i16(float v, float scale) {
  float x = roundf(v * scale);
  if (x > 32767.0f) return 32767;
  if (x < -32768.0f) return -32768;
  return (int16_t)x;
}

static inline int16_t imu_temp_c_to_centi(float temp_c) {
  float x = roundf(temp_c * IMU_TEMP_CENTI_SCALE);
  if (x > 32767.0f) return 32767;
  if (x < -32768.0f) return -32768;
  return (int16_t)x;
}

static void imuRetxRingStore(uint32_t seq, uint64_t micros, int16_t ax, int16_t ay, int16_t az,
                            int16_t gx, int16_t gy, int16_t gz,
                            int16_t mx, int16_t my, int16_t mz, int16_t temp_centi_c);
void sendSyncRequest();

#if ENABLE_WIFI_SEND
static void imuOfflineQueueReset(void);
static void imuLowRssiQueueReset(void);
#if SLAVE_SYNC_MASTER_DRIVEN
static void slaveStartSyncFromMasterRequest(void);
#endif
#if !SLAVE_SYNC_MASTER_DRIVEN
static void beginSyncRoundNow(const char *reason);
#endif
static void requestImmediateResyncAfterEspNowFail(const char *reason);
static void imuOfflineBatchPush(const imu_batch_packet_t *b);
static void espNowImuSendNotifyOk(void) {
  imuTxFailStreak = 0;
  imuTxNextAttemptMs = 0;
}

static bool imuTxAttemptReady(void) {
  return (int32_t)(millis() - imuTxNextAttemptMs) >= 0;
}

static void imuTxScheduleBackoff(void) {
  imuTxNextAttemptMs = millis() + (unsigned long)IMU_TX_FAIL_RETRY_GAP_MS;
}

static bool imuTxFailResyncEligible(void) {
  if (!connected || !timeSynced) {
    return true;
  }
  if (lastAckTime != 0UL &&
      (unsigned long)(millis() - lastAckTime) <=
          (unsigned long)(CONNECTION_TIMEOUT_MS / 2)) {
    return false;
  }
  return true;
}

static void espNowImuSendNotifyFail(const char *reason,
                                    const imu_batch_packet_t *saveBatch) {
  if (saveBatch != NULL) {
    imuOfflineBatchPush(saveBatch);
  }
  imuTxScheduleBackoff();
  if (!imuTxFailResyncEligible()) {
    static unsigned long s_imuFailHoldLogMs = 0;
    const unsigned long nowMs = millis();
    if (nowMs - s_imuFailHoldLogMs >= 1000UL) {
      s_imuFailHoldLogMs = nowMs;
      Serial.printf(
          "LINK: %s (saved offline, SYNC/ACK OK — retry in %u ms)\n", reason,
          (unsigned)IMU_TX_FAIL_RETRY_GAP_MS);
    }
    return;
  }
  if (imuTxFailStreak < 255U) {
    imuTxFailStreak++;
  }
  if (imuTxFailStreak >= IMU_TX_FAIL_RESYNC_AFTER) {
    imuTxFailStreak = 0;
    requestImmediateResyncAfterEspNowFail(reason);
    return;
  }
  Serial.printf("LINK: %s (saved offline, resync after %u more fail(s))\n",
                reason,
                (unsigned)(IMU_TX_FAIL_RESYNC_AFTER - imuTxFailStreak));
}
#endif
#if ENABLE_IMU_DEDICATED_TASK
static void imuBatchTxQueueDrain(void);
#endif

// ======================== RADIO ========================
#if SLAVE_WIFI_TX_POWER_ADAPTIVE || SLAVE_WIFI_TX_POWER_NORM_QDB > 0
static int8_t s_slaveWifiTxQdb = 0;
static bool s_slaveWifiTxBoosted = false;
static uint32_t s_slaveWifiTxLastAdjMs = 0;

static int8_t slaveWifiClampTxQdb(int8_t qdb) {
  if (qdb < 8) {
    return 8;
  }
  if (qdb > 84) {
    return 84;
  }
  return qdb;
}

static bool slaveWifiApplyTxPowerQdb(int8_t qdb) {
  qdb = slaveWifiClampTxQdb(qdb);
  if (qdb == s_slaveWifiTxQdb) {
    return false;
  }
  const esp_err_t e = esp_wifi_set_max_tx_power(qdb);
  if (e != ESP_OK) {
    return false;
  }
  s_slaveWifiTxQdb = qdb;
  return true;
}

static void slaveWifiTxPowerInit(void) {
  s_slaveWifiTxBoosted = true;
  s_slaveWifiTxLastAdjMs = 0;
  if (slaveWifiApplyTxPowerQdb((int8_t)SLAVE_WIFI_TX_POWER_MAX_QDB)) {
    Serial.printf("[LINK] WiFi init: TX max quarter-dBm=%d (~%.1f dBm), PS=none\n",
                  (int)s_slaveWifiTxQdb, (double)s_slaveWifiTxQdb * 0.25);
  }
#if SLAVE_WIFI_TX_POWER_ADAPTIVE
  if (SLAVE_WIFI_TX_POWER_NORM_QDB < SLAVE_WIFI_TX_POWER_MAX_QDB) {
    s_slaveWifiTxBoosted = false;
    slaveWifiApplyTxPowerQdb((int8_t)SLAVE_WIFI_TX_POWER_NORM_QDB);
  }
#endif
}

static void slaveWifiTxPowerUpdateFromRssi(int8_t rssiDb) {
#if SLAVE_WIFI_TX_POWER_ADAPTIVE
  const uint32_t now = millis();
  if (s_slaveWifiTxLastAdjMs != 0U &&
      (uint32_t)(now - s_slaveWifiTxLastAdjMs) < SLAVE_WIFI_TX_POWER_ADJ_INTERVAL_MS) {
    return;
  }

  bool wantBoost;
  if (rssiDb < (int8_t)SLAVE_WIFI_TX_RSSI_BOOST_DB) {
    wantBoost = true;
  } else if (rssiDb >= (int8_t)SLAVE_WIFI_TX_RSSI_RESTORE_DB) {
    wantBoost = false;
  } else {
    return;
  }

  if (wantBoost == s_slaveWifiTxBoosted) {
    return;
  }

  const int8_t target =
      wantBoost ? (int8_t)SLAVE_WIFI_TX_POWER_BOOST_QDB
                : (int8_t)SLAVE_WIFI_TX_POWER_NORM_QDB;
  if (!slaveWifiApplyTxPowerQdb(target)) {
    return;
  }
  s_slaveWifiTxBoosted = wantBoost;
  s_slaveWifiTxLastAdjMs = now;
  Serial.printf("[LINK] TX power %s: quarter-dBm=%d (~%.1f dBm), RSSI=%d dBm\n",
                wantBoost ? "BOOST" : "NORM", (int)target, (double)target * 0.25,
                (int)rssiDb);
#endif
}

static bool slaveRssiTooWeakForSync(void) {
#if SLAVE_SYNC_RSSI_GATE
  return (g_slaveLastRxRssiValid != 0U) &&
         (g_slaveLastRxRssiDb < (int8_t)SLAVE_SYNC_MIN_RSSI_DB);
#else
  return false;
#endif
}

static void slaveSyncSkipLogRssiWeak(void) {
  static uint32_t s_lastLogMs = 0;
  const uint32_t now = millis();
  if (s_lastLogMs != 0U && (uint32_t)(now - s_lastLogMs) < 3000U) {
    return;
  }
  s_lastLogMs = now;
  if (g_slaveLastRxRssiValid != 0U) {
    Serial.printf(
        "SYNC: bo qua — RSSI yeu (%d dBm < %d dBm)\n",
        (int)g_slaveLastRxRssiDb, (int)SLAVE_SYNC_MIN_RSSI_DB);
  } else {
    Serial.println("SYNC: bo qua — chua co RSSI hop le tu master");
  }
}

static void slaveWifiTxPowerRestoreNorm(void) {
  s_slaveWifiTxBoosted = (SLAVE_WIFI_TX_POWER_NORM_QDB >= SLAVE_WIFI_TX_POWER_BOOST_QDB);
  s_slaveWifiTxLastAdjMs = 0;
  slaveWifiApplyTxPowerQdb((int8_t)SLAVE_WIFI_TX_POWER_MAX_QDB);
#if SLAVE_WIFI_TX_POWER_ADAPTIVE
  if (SLAVE_WIFI_TX_POWER_NORM_QDB < SLAVE_WIFI_TX_POWER_MAX_QDB) {
    s_slaveWifiTxBoosted = false;
    slaveWifiApplyTxPowerQdb((int8_t)SLAVE_WIFI_TX_POWER_NORM_QDB);
  }
#endif
}
#endif

void setupRadio() {
  WiFi.mode(WIFI_STA);
  WiFi.disconnect(true, true);
  esp_wifi_set_ps(WIFI_PS_NONE);
  esp_wifi_set_channel(CHANNEL, WIFI_SECOND_CHAN_NONE);

#if USE_LONG_RANGE
  esp_wifi_set_protocol(WIFI_IF_STA,
                        WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G |
                        WIFI_PROTOCOL_11N | WIFI_PROTOCOL_LR);
#else
  esp_wifi_set_protocol(WIFI_IF_STA,
                        WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G |
                        WIFI_PROTOCOL_11N);
#endif

  uint8_t ch;
  wifi_second_chan_t sc;
  esp_wifi_get_channel(&ch, &sc);
  Serial.printf("CH=%u%s\n", ch, USE_LONG_RANGE ? " (LR ON)" : "");
#if SLAVE_WIFI_TX_POWER_ADAPTIVE || SLAVE_WIFI_TX_POWER_NORM_QDB > 0
  slaveWifiTxPowerInit();
#endif
}

