caonam-tugraz/MultiIMU-GaitSync/firmware/slave_icm42688p/ESP32_ICM42688P_IMU.ino
bool addMasterPeer() {
  if (esp_now_is_peer_exist(masterMAC)) {
    esp_now_del_peer(masterMAC);
  }

  esp_now_peer_info_t p = {};
  memcpy(p.peer_addr, masterMAC, 6);
  p.channel = CHANNEL;
  p.ifidx = WIFI_IF_STA;
  p.encrypt = false;

  return esp_now_add_peer(&p) == ESP_OK;
}

void disconnectFromMaster(const char *reason) {
  const bool wasTimeSynced = timeSynced;
  connected = false;
  disconnectedSince = millis();
  syncRunning = false;
#if ENABLE_WIFI_SEND
  helloConnectFailCount = 0;
#endif
  lastAckTime = 0;
  clearMasterSlotAssignment();
  lastHelloTime = millis() - (unsigned long)HELLO_RECONNECT_INTERVAL - 1UL;
  lastSyncTime = millis();
  networkDelayUs = 0;
#if ENABLE_WIFI_SEND
  imuLowRssiQueueReset();
#if ENABLE_IMU_DEDICATED_TASK
  imuBatchTxQueueDrain();
#endif
  espnowTxResult = 0;
  if (wasTimeSynced) {
    imuOfflineCaptureMode = true;
    if (syncDriftCompActive() && syncDriftAnchorLocalUs == 0ULL) {
      syncDriftAnchorLocalUs = nowUs();
    }
    Serial.printf(
        "LINK: mat ket noi — ghi IMU offline (toi da %u lo, %u mau)\n",
        (unsigned)IMU_OFFLINE_BATCH_CAP, (unsigned)IMU_OFFLINE_BUFFER_SAMPLES);
  } else {
    imuOfflineCaptureMode = false;
    timeSynced = false;
    globalTimeOffset = 0;
    globalTimeOffsetTarget = 0;
    syncPrevDriftSampleValid = false;
    syncDriftAnchorLocalUs = 0;
    syncDriftLastCompMs = 0;
    syncDriftRecentReset();
    imuOfflineQueueReset();
  }
#else
  timeSynced = false;
  globalTimeOffset = 0;
  globalTimeOffsetTarget = 0;
  syncPrevDriftSampleValid = false;
  syncDriftAnchorLocalUs = 0;
  syncDriftLastCompMs = 0;
  syncDriftRecentReset();
#endif
  g_slaveLastRxRssiValid = 0;
#if SLAVE_WIFI_TX_POWER_ADAPTIVE || SLAVE_WIFI_TX_POWER_NORM_QDB > 0
  slaveWifiTxPowerRestoreNorm();
#endif
  ledOffAt = 0;
  digitalWrite(LED_PIN, LOW);
  Serial.println(reason);
}

#if ENABLE_WIFI_SEND
static void linkResetChipAfterHelloFailures(void) {
  Serial.printf(
      "LINK: %u lan HELLO/ket noi khong thanh cong -> reset chip\n",
      (unsigned)LINK_HELLO_FAIL_RESET_MAX);
  delay(50);
  esp_restart();
}

static void linkHelloConnectAttemptFailed(void) {
  if (helloConnectFailCount < 255) {
    helloConnectFailCount++;
  }
  if (helloConnectFailCount >= LINK_HELLO_FAIL_RESET_MAX) {
    linkResetChipAfterHelloFailures();
  }
}

// Arduino-ESP32 3.x / ESP-IDF 5+: send_cb dùng wifi_tx_info_t; core cũ dùng const uint8_t* MAC.
#if (defined(ARDUINO_ESP32_MAJOR) && (ARDUINO_ESP32_MAJOR >= 3)) ||                        \
    (defined(ESP_IDF_VERSION_MAJOR) && (ESP_IDF_VERSION_MAJOR >= 5))
void onEspNowSendCb(const wifi_tx_info_t *info, esp_now_send_status_t status) {
  (void)info;
#else
void onEspNowSendCb(const uint8_t *mac_addr, esp_now_send_status_t status) {
  (void)mac_addr;
#endif
  if (status == ESP_NOW_SEND_SUCCESS) {
    espnowTxResult = 1U;
    if (connected) {
      lastAckTime = millis();
    }
  } else {
    espnowTxResult = 2U;
  }
}

static bool espNowWaitTxResult(uint32_t waitMs) {
  const uint32_t t0 = millis();
  while (espnowTxResult == 0 && (millis() - t0 < waitMs)) {
    yield();
  }
  if (espnowTxResult == 1U) {
    return true;
  }
  return false;
}

/**
 * Một lần esp_now_send + chờ callback (HELLO/IMU…). Không retry ngay — giảm xung đột RF;
 * IMU fail sẽ dừng stream và mở lại SYNC ở tầng gọi.
 */
static bool espNowSendOnce(const uint8_t *dst, uint8_t *data, size_t len) {
  espnowTxResult = 0;
  esp_err_t err = esp_now_send(dst, data, len);
  if (err != ESP_OK) {
    return false;
  }
  return espNowWaitTxResult(ESPNOW_SEND_WAIT_MS);
}

static bool espNowSendSyncPacket(const uint8_t *dst, packet_t *syncPkt) {
  espnowTxResult = 0;
  const uint64_t tSend = nowUs();
  syncPkt->timestamp = (uint32_t)(tSend / 1000ULL);
  syncPkt->micros_timestamp = tSend;
  syncPkt->request_time = tSend;
  esp_err_t err = esp_now_send(dst, (uint8_t *)syncPkt, sizeof(*syncPkt));
  if (err != ESP_OK) {
    return false;
  }
  return espNowWaitTxResult(ESPNOW_SYNC_SEND_WAIT_MS);
}

static imu_batch_packet_t imuOfflineBatches[IMU_OFFLINE_BATCH_CAP];
static uint8_t imuOfflineBatchCount = 0;
static uint8_t imuOfflineHead = 0;

static void imuOfflineQueueReset(void) {
  imuOfflineBatchCount = 0;
  imuOfflineHead = 0;
}

#if ENABLE_WIFI_SEND
static bool imuOfflineCaptureActive(void) {
  return imuOfflineCaptureMode && timeSynced && !connected &&
         (imuOfflineBatchCount < IMU_OFFLINE_BATCH_CAP);
}

static void imuOfflineCaptureEndOnReconnect(void) {
  if (!imuOfflineCaptureMode) {
    return;
  }
  imuOfflineCaptureMode = false;
  timeSynced = false;
  globalTimeOffset = 0;
  globalTimeOffsetTarget = 0;
}
#else
static bool imuOfflineCaptureActive(void) {
  return false;
}
#endif

static imu_batch_packet_t imuLowRssiQ[SLAVE_IMU_LOW_RSSI_QUEUE_CAP];
static uint8_t imuLowRssiHead = 0;
static uint8_t imuLowRssiCount = 0;

static bool s_imuLowRssiTxActive = false;
static imu_batch_packet_t s_imuLowRssiTxPkt = {};
static uint8_t s_imuLowRssiTxAttempt = 0;
static uint32_t s_imuLowRssiTxNextMs = 0;

static void imuLowRssiQueueReset(void) {
  imuLowRssiHead = 0;
  imuLowRssiCount = 0;
  s_imuLowRssiTxActive = false;
  s_imuLowRssiTxAttempt = 0;
}

static void imuLowRssiEnqueue(const imu_batch_packet_t *b) {
  if (SLAVE_IMU_LOW_RSSI_QUEUE_CAP == 0U) {
    return;
  }
  if (imuLowRssiCount >= (uint8_t)SLAVE_IMU_LOW_RSSI_QUEUE_CAP) {
    imuLowRssiHead =
        (uint8_t)((imuLowRssiHead + 1U) % (uint8_t)SLAVE_IMU_LOW_RSSI_QUEUE_CAP);
    imuLowRssiCount--;
  }
  const uint8_t tail = (uint8_t)(
      (imuLowRssiHead + imuLowRssiCount) % (uint8_t)SLAVE_IMU_LOW_RSSI_QUEUE_CAP);
  imuLowRssiQ[tail] = *b;
  imuLowRssiCount++;
}

/** Đầy thì bỏ batch cũ nhất (FIFO). */
static void imuOfflineBatchPush(const imu_batch_packet_t *b) {
  if (imuOfflineBatchCount >= IMU_OFFLINE_BATCH_CAP) {
    imuOfflineHead = (uint8_t)((imuOfflineHead + 1U) % IMU_OFFLINE_BATCH_CAP);
    imuOfflineBatchCount--;
  }
  uint8_t tail =
      (uint8_t)((imuOfflineHead + imuOfflineBatchCount) % IMU_OFFLINE_BATCH_CAP);
  imuOfflineBatches[tail] = *b;
  imuOfflineBatchCount++;
}

