caonam-tugraz/MultiIMU-GaitSync/firmware/slave_icm42688p/ESP32_ICM42688P_IMU.ino
static bool masterSlotValid = false;
static uint8_t masterSyncSlot = 0;
#if ENABLE_IMU_TX_SLOT
static uint8_t imuTxSlotIndex = 0;
static bool imuTxSlotInit = false;
#endif

static void clearMasterSlotAssignment() {
  masterSlotValid = false;
  masterSyncSlot = 0;
#if ENABLE_IMU_TX_SLOT
  imuTxSlotInit = false;
#endif
}

static void applyMasterSlotFromPacket(const packet_t *pkt) {
  if (!(pkt->slot_flags & PACKET_T_SLOT_FLAG_VALID)) {
    return;
  }
  if (pkt->sync_slot < MASTER_SYNC_SLOT_COUNT) {
    masterSyncSlot = pkt->sync_slot;
  }
  masterSlotValid = true;
#if ENABLE_IMU_TX_SLOT
  if (pkt->imu_tx_slot == MASTER_SLOT_UNASSIGNED ||
      pkt->imu_tx_slot >= IMU_TX_SLOT_COUNT) {
    return;
  }
  imuTxSlotIndex = pkt->imu_tx_slot;
  imuTxSlotInit = true;
#if DEBUG_IMU_SLOT_SERIAL
  Serial.printf(
      "[IMU] TX slot=%u/%u (Master cap), SYNC_slot=%u, frame=%lu us\n",
      (unsigned)imuTxSlotIndex, (unsigned)IMU_TX_SLOT_COUNT,
      (unsigned)masterSyncSlot,
      (unsigned long)((uint64_t)IMU_TX_SLOT_COUNT * (uint64_t)IMU_TX_SLOT_US));
#endif
#else
#if DEBUG_IMU_SLOT_SERIAL
  Serial.printf("[IMU] SYNC_slot=%u (Master cap)\n", (unsigned)masterSyncSlot);
#endif
#endif
}

#if ENABLE_IMU_TX_SLOT
static void ensureImuTxSlotIndex() {
  if (imuTxSlotInit) {
    return;
  }
  uint8_t mac[6];
#if ESP_IDF_VERSION_MAJOR >= 5
  esp_wifi_get_mac(WIFI_IF_STA, mac);
#else
  esp_read_mac(mac, ESP_MAC_WIFI_STA);
#endif
  uint16_t h = (uint16_t)mac[4] | ((uint16_t)mac[5] << 8);
  imuTxSlotIndex = (uint8_t)(h % IMU_TX_SLOT_COUNT);
  imuTxSlotInit = true;
#if DEBUG_IMU_SLOT_SERIAL
  Serial.printf(
      "[IMU] TX slot=%u/%u, frame=%lu us (fallback MAC hash)\n",
      (unsigned)imuTxSlotIndex, IMU_TX_SLOT_COUNT,
      (unsigned long)((uint64_t)IMU_TX_SLOT_COUNT * (uint64_t)IMU_TX_SLOT_US));
#endif
}

/** Chờ tới slot của this slave (đồng hồ master qua getGlobalTimeUs). */
static void waitUntilMyTxSlot() {
  if (!timeSynced) {
    return;
  }
  ensureImuTxSlotIndex();
  const uint64_t frameUs =
      (uint64_t)IMU_TX_SLOT_COUNT * (uint64_t)IMU_TX_SLOT_US;
  uint64_t tStart = (uint64_t)getGlobalTimeUs();
  for (;;) {
    uint64_t g = (uint64_t)getGlobalTimeUs();
    uint64_t tmod = g % frameUs;
    uint32_t slot = (uint32_t)(tmod / (uint64_t)IMU_TX_SLOT_US);
    if (slot == (uint32_t)imuTxSlotIndex) {
      break;
    }
    if ((g - tStart) > (uint64_t)IMU_TX_SLOT_MAX_SPIN_US) {
      break;
    }
    yield();
  }
}
#endif

static uint32_t syncPeriodicMinGapMs(void) {
  return (syncPeriodicIntervalMs > SYNC_PERIODIC_MAX_OFFSET_MS)
             ? (syncPeriodicIntervalMs - SYNC_PERIODIC_MAX_OFFSET_MS)
             : 0U;
}

static void syncPeriodicIntervalBumpAfterDone(void) {
#if SYNC_INTERVAL_STEP_MS == 0U
  return;
#endif
  if (syncPeriodicIntervalMs >= (uint32_t)SYNC_INTERVAL_MS) {
    return;
  }
  uint32_t next = syncPeriodicIntervalMs + SYNC_INTERVAL_STEP_MS;
  if (next > (uint32_t)SYNC_INTERVAL_MS) {
    next = (uint32_t)SYNC_INTERVAL_MS;
  }
  if (next == syncPeriodicIntervalMs) {
    return;
  }
  syncPeriodicIntervalMs = next;
  Serial.printf("[SYNC] periodic interval -> %lu ms (max %d ms)\n",
                (unsigned long)syncPeriodicIntervalMs, SYNC_INTERVAL_MS);
}

static uint8_t syncPeriodicMacSlotIndex() {
  if (masterSlotValid && masterSyncSlot < MASTER_SYNC_SLOT_COUNT) {
    return masterSyncSlot;
  }
  uint8_t mac[6];
#if ESP_IDF_VERSION_MAJOR >= 5
  esp_wifi_get_mac(WIFI_IF_STA, mac);
#else
  esp_read_mac(mac, ESP_MAC_WIFI_STA);
#endif
  return (uint8_t)(mac[5] / SYNC_PERIODIC_MAC_SLOT_DIVISOR);
}

static uint32_t syncPeriodicSlotOffsetMs() {
  return (uint32_t)syncPeriodicMacSlotIndex() *
         (uint32_t)SYNC_PERIODIC_SLOT_SPACING_MS;
}

static bool syncPeriodicSlotReady() {
  if (!timeSynced) {
    return true;
  }
  const uint32_t offsetMs = syncPeriodicSlotOffsetMs();
  const uint32_t intervalMs = syncPeriodicIntervalMs;
  const uint32_t phaseMs =
      (uint32_t)(((uint64_t)getGlobalTimeUs() / 1000ULL) % (uint64_t)intervalMs);
  return phaseMs >= offsetMs &&
         phaseMs < (offsetMs + (uint32_t)SYNC_PERIODIC_SLOT_WINDOW_MS);
}

/**
 * Một bước / lần gọi: gửi lô từ đệm RSSI thấp — tối đa SLAVE_IMU_LOW_RSSI_SENDS lần,
 * cách SLAVE_IMU_LOW_RSSI_SEND_GAP_MS; dừng sớm khi gửi OK (tránh trùng seq trên master).
 */
static void imuLowRssiService(void) {
  if (!connected || !timeSynced) {
    imuLowRssiQueueReset();
    return;
  }
  if (syncRunning) {
    return;
  }
  if (!imuTxAttemptReady()) {
    return;
  }
  const uint32_t now = millis();
  if (!s_imuLowRssiTxActive) {
    if (imuLowRssiCount == 0U) {
      return;
    }
    s_imuLowRssiTxPkt = imuLowRssiQ[imuLowRssiHead];
    imuLowRssiHead =
        (uint8_t)((imuLowRssiHead + 1U) % (uint8_t)SLAVE_IMU_LOW_RSSI_QUEUE_CAP);
    imuLowRssiCount--;
    s_imuLowRssiTxActive = true;
    s_imuLowRssiTxAttempt = 0U;
    s_imuLowRssiTxNextMs = now;
  }
  if ((int32_t)(now - s_imuLowRssiTxNextMs) < 0) {
    return;
  }
  const size_t wire = IMU_BATCH_HEADER_SIZE +
                      (size_t)(IMU_BATCH_SAMPLES - 1) * sizeof(imu_batch_delta_t);
#if ENABLE_IMU_TX_SLOT
  waitUntilMyTxSlot();
#endif
  if (espNowSendOnce(masterMAC, (uint8_t *)&s_imuLowRssiTxPkt, wire)) {
    espNowImuSendNotifyOk();
    s_imuLowRssiTxActive = false;
    return;
  }
  s_imuLowRssiTxAttempt++;
  if (s_imuLowRssiTxAttempt < (uint8_t)SLAVE_IMU_LOW_RSSI_SENDS) {
    s_imuLowRssiTxNextMs = now + (uint32_t)SLAVE_IMU_LOW_RSSI_SEND_GAP_MS;
    return;
  }
  s_imuLowRssiTxActive = false;
  espNowImuSendNotifyFail("ESP-NOW IMU low-RSSI retry failed",
                          &s_imuLowRssiTxPkt);
}

static void drainImuOfflineQueue() {
  if (!imuStreamReady() || syncRunning || imuOfflineBatchCount == 0U ||
      !imuTxAttemptReady()) {
    return;
  }
#if ENABLE_IMU_TX_SLOT
  waitUntilMyTxSlot();
#endif
  imu_batch_packet_t *b = &imuOfflineBatches[imuOfflineHead];
  size_t wire = IMU_BATCH_HEADER_SIZE +
                (size_t)(IMU_BATCH_SAMPLES - 1) * sizeof(imu_batch_delta_t);
  if (espNowSendOnce(masterMAC, (uint8_t *)b, wire)) {
    espNowImuSendNotifyOk();
    imuOfflineHead =
        (uint8_t)((imuOfflineHead + 1U) % IMU_OFFLINE_BATCH_CAP);
    imuOfflineBatchCount--;
  } else {
    espNowImuSendNotifyFail("ESP-NOW offline IMU batch failed", NULL);
  }
}

#if ENABLE_IMU_DEDICATED_TASK
static void imuBatchTxQueueDrain(void) {
  if (imuBatchTxQueue == NULL) {
    return;
  }
  imu_batch_packet_t discard;
  while (xQueueReceive(imuBatchTxQueue, &discard, 0) == pdPASS) {
    /* bỏ lô chờ gửi — tránh gửi timestamp theo offset cũ sau reconnect */
  }
}
#endif

#if SLAVE_SYNC_MASTER_DRIVEN
static void slaveStartSyncFromMasterRequest(void) {
  if (!connected || syncRunning) {
    return;
  }
  if (slaveRssiTooWeakForSync()) {
    slaveSyncSkipLogRssiWeak();
    return;
  }
  Serial.println("SYNC: master TSRQ -> starting round...");
  timeSynced = false;
  globalTimeOffset = 0;
  globalTimeOffsetTarget = 0;
  syncRunning = true;
  lastSyncTime = 0;
  lastSyncSampleSentMs = millis() - (unsigned long)SYNC_SAMPLE_GAP_MS;
  syncPrevDriftSampleValid = false;
  syncDriftAnchorLocalUs = 0;
  syncDriftRecentReset();
  imuTxFailStreak = 0;
  syncLastSendOk = true;
#if ENABLE_IMU_DEDICATED_TASK
  imuBatchTxQueueDrain();
#endif
  sendSyncRequest();
}
#endif

