caonam-tugraz/MultiIMU-GaitSync/firmware/slave_icm42688p/ESP32_ICM42688P_IMU.ino
#if !SLAVE_SYNC_MASTER_DRIVEN
static void beginSyncRoundNow(const char *reason) {
  if (!connected || syncRunning) {
    return;
  }
  if (slaveRssiTooWeakForSync()) {
    slaveSyncSkipLogRssiWeak();
    return;
  }
  Serial.printf("LINK: %s\n", reason);
  Serial.println("Starting SYNC (TIME required before IMU)...");
  timeSynced = false;
  globalTimeOffset = 0;
  globalTimeOffsetTarget = 0;
  syncRunning = true;
  lastSyncTime = 0;
  lastSyncSampleSentMs = millis() - (unsigned long)SYNC_SAMPLE_GAP_MS;
  syncPrevDriftSampleValid = false;
  syncDriftAnchorLocalUs = 0;
  syncDriftRecentReset();
  imuTxFailStreak = 0;
  syncLastSendOk = true;
#if ENABLE_IMU_DEDICATED_TASK
  imuBatchTxQueueDrain();
#endif
  sendSyncRequest();
}
#endif

static void requestImmediateResyncAfterEspNowFail(const char *reason) {
#if SLAVE_SYNC_MASTER_DRIVEN
  Serial.printf("LINK: %s -> cho master TSRQ (khong tu gui SYNC)\n", reason);
  timeSynced = false;
  syncRunning = false;
  syncPrevDriftSampleValid = false;
  syncDriftAnchorLocalUs = 0;
  syncDriftRecentReset();
  imuTxFailStreak = 0;
#if ENABLE_IMU_DEDICATED_TASK
  imuBatchTxQueueDrain();
#endif
#else
  beginSyncRoundNow(reason);
#endif
}
#endif

// ======================== SEND ========================
void sendHello() {
  packet_t helloPacket = {};
  strcpy(helloPacket.type, "HELLO");

#if ESP_IDF_VERSION_MAJOR >= 5
  esp_wifi_get_mac(WIFI_IF_STA, helloPacket.mac);
#else
  esp_read_mac(helloPacket.mac, ESP_MAC_WIFI_STA);
#endif

  helloPacket.node_id = (uint32_t)(ESP.getEfuseMac() & 0xFFFFFF);
  helloPacket.timestamp = nowMs();
  helloPacket.micros_timestamp = nowUs();
  helloPacket.timezone_offset = timezoneOffset;
  helloPacket.request_time = 0;
  helloPacket.response_time = 0;
  helloPacket.slave_adc_raw = 0;
  helloPacket.last_sync_rtt_us = 0;

#if ENABLE_WIFI_SEND
  if (!connected) {
    Serial.println(
        "LINK: dang gui HELLO toi master (chua ket noi), doi ACK...");
    (void)espNowSendOnce(masterMAC, (uint8_t *)&helloPacket, sizeof(helloPacket));
    linkHelloConnectAttemptFailed();
  } else {
    (void)espNowSendOnce(masterMAC, (uint8_t *)&helloPacket, sizeof(helloPacket));
  }
#endif
  lastHelloTime = millis();
}

void sendSyncRequest() {
  if (slaveRssiTooWeakForSync()) {
    return;
  }
  packet_t syncRequest = {};
  strcpy(syncRequest.type, "SYNC");

#if ESP_IDF_VERSION_MAJOR >= 5
  esp_wifi_get_mac(WIFI_IF_STA, syncRequest.mac);
#else
  esp_read_mac(syncRequest.mac, ESP_MAC_WIFI_STA);
#endif

  syncRequest.node_id = (uint32_t)(ESP.getEfuseMac() & 0xFFFFFF);
  syncRequest.timezone_offset = timezoneOffset;
  syncRequest.response_time = 0;
  syncRequest.slave_adc_raw = readVbatAdcRaw();
  syncRequest.last_sync_rtt_us = lastCompletedSyncBestRttUs;

#if ENABLE_WIFI_SEND
  syncLastSendOk = espNowSendSyncPacket(masterMAC, &syncRequest);
#else
  syncLastSendOk = true;
#endif
}

void printImuDataSerial(const uint8_t *mac, uint64_t micros, uint32_t seq,
                        float ax, float ay, float az, float gx, float gy,
                        float gz, float temp_c) {
  Serial.printf(
      "IMU,%02X:%02X:%02X:%02X:%02X:%02X,%llu,%lu,%.6f,%.6f,%.6f,%.6f,%.6f,%.6f,%.4f\n",
      mac[0], mac[1], mac[2], mac[3], mac[4], mac[5],
      (unsigned long long)micros, (unsigned long)seq, ax, ay, az, gx, gy, gz,
      temp_c);
}

/** Gửi một lô IMU đã đóng gói (ESP-NOW hoặc offline). */
static void imuTransmitBatchPacket(const imu_batch_packet_t *b) {
  size_t wire = IMU_BATCH_HEADER_SIZE +
                (size_t)(IMU_BATCH_SAMPLES - 1) * sizeof(imu_batch_delta_t);
#if ENABLE_WIFI_SEND
  if (!imuStreamReady()) {
    return;
  }
  if (!imuTxAttemptReady()) {
    imuOfflineBatchPush(b);
    return;
  }
  const bool rssiLow = (g_slaveLastRxRssiValid != 0U) &&
                       (g_slaveLastRxRssiDb < (int8_t)SLAVE_IMU_LOW_RSSI_DB);
  if (rssiLow) {
    imuLowRssiEnqueue(b);
    imuLowRssiService();
    return;
  }
#if ENABLE_IMU_TX_SLOT
  waitUntilMyTxSlot();
#endif
  if (espNowSendOnce(masterMAC, (uint8_t *)b, wire)) {
    espNowImuSendNotifyOk();
  } else {
    espNowImuSendNotifyFail("ESP-NOW IMU batch failed", b);
  }
#endif
}

/**
 * use_tx_queue=true: đủ lô → xQueueSend (loop gửi RF); không chặn SYNC.
 * use_tx_queue=false: gửi ngay trong loop (chế độ cũ).
 * readImuSample thất bại: không tăng imuSampleSeq (khớp BNO055).
 */
static bool imuSampleProcessOne(bool use_tx_queue) {
  static int16_t batch_ax[IMU_BATCH_SAMPLES];
  static int16_t batch_ay[IMU_BATCH_SAMPLES];
  static int16_t batch_az[IMU_BATCH_SAMPLES];
  static int16_t batch_gx[IMU_BATCH_SAMPLES];
  static int16_t batch_gy[IMU_BATCH_SAMPLES];
  static int16_t batch_gz[IMU_BATCH_SAMPLES];
  static uint64_t batch_micros[IMU_BATCH_SAMPLES];
  static uint8_t batch_fill = 0;

  if (!imuSampleAllowed()) {
    batch_fill = 0;
    return false;
  }

  digitalWrite(PULSE_PIN, HIGH);
  float ax, ay, az;
  float gx, gy, gz;
  float temp_c = 0.0f;
  const bool imuReadOk = readImuSample(ax, ay, az, gx, gy, gz, temp_c);
  digitalWrite(PULSE_PIN, LOW);
  if (!imuReadOk) {
    return false;
  }

  applyAccelCalibration(ax, ay, az);
  applyGyroCalibration(gx, gy, gz);

  if (!imuStreamReady() && !imuOfflineCaptureActive()) {
    batch_fill = 0;
    return true;
  }

  const uint64_t tu = imuTimestampForSampleLoggedUs();

  batch_ax[batch_fill] = imu_float_to_i16(ax, IMU_RAW_ACC_SCALE);
  batch_ay[batch_fill] = imu_float_to_i16(ay, IMU_RAW_ACC_SCALE);
  batch_az[batch_fill] = imu_float_to_i16(az, IMU_RAW_ACC_SCALE);
  batch_gx[batch_fill] = imu_float_to_i16(gx, IMU_RAW_GYRO_SCALE);
  batch_gy[batch_fill] = imu_float_to_i16(gy, IMU_RAW_GYRO_SCALE);
  batch_gz[batch_fill] = imu_float_to_i16(gz, IMU_RAW_GYRO_SCALE);
  batch_micros[batch_fill] = tu;
  batch_fill++;

#if SERIAL_IMU_OUTPUT
  uint8_t macDbg[6];
#if ESP_IDF_VERSION_MAJOR >= 5
  esp_wifi_get_mac(WIFI_IF_STA, macDbg);
#else
  esp_read_mac(macDbg, ESP_MAC_WIFI_STA);
#endif
  printImuDataSerial(macDbg, tu, imuSampleSeq, ax, ay, az, gx, gy, gz,
                     temp_c);
#endif

