caonam-tugraz/MultiIMU-GaitSync/firmware/slave_icm42688p/ESP32_ICM42688P_IMU.ino
  imuSampleSeq++;
  imuPacketCount++;

  {
    const uint8_t bi = (uint8_t)(batch_fill - 1U);
    imuRetxRingStore(
        imuSampleSeq - 1U, tu, batch_ax[bi], batch_ay[bi], batch_az[bi],
        batch_gx[bi], batch_gy[bi], batch_gz[bi],
        IMU_MAG_INT16_NONE, IMU_MAG_INT16_NONE, IMU_MAG_INT16_NONE,
        imu_temp_c_to_centi(temp_c));
  }

  if (batch_fill < IMU_BATCH_SAMPLES) {
    if (!use_tx_queue) {
      yield();
    }
    return true;
  }

  imu_batch_packet_t b = {};
  memcpy(b.type, "IMU_RAWB\0", 8);
#if ESP_IDF_VERSION_MAJOR >= 5
  esp_wifi_get_mac(WIFI_IF_STA, b.mac);
#else
  esp_read_mac(b.mac, ESP_MAC_WIFI_STA);
#endif
  b.node_id = (uint32_t)(ESP.getEfuseMac() & 0xFFFFFF);
  b.count = IMU_BATCH_SAMPLES;
  b.sample_seq0 = imuSampleSeq - IMU_BATCH_SAMPLES;
  b.micros_t0 = batch_micros[0];
  b.ax0 = batch_ax[0];
  b.ay0 = batch_ay[0];
  b.az0 = batch_az[0];
  b.gx0 = batch_gx[0];
  b.gy0 = batch_gy[0];
  b.gz0 = batch_gz[0];
  b.mx0 = IMU_MAG_INT16_NONE;
  b.my0 = IMU_MAG_INT16_NONE;
  b.mz0 = IMU_MAG_INT16_NONE;
  b.temp_centi_c = imu_temp_c_to_centi(temp_c);

  for (int i = 1; i < IMU_BATCH_SAMPLES; i++) {
    uint64_t prev = batch_micros[i - 1];
    uint64_t cur = batch_micros[i];
    uint64_t d = (cur >= prev) ? (cur - prev) : 0ULL;
    if (d > 65535ULL) {
      d = 65535ULL;
    }
    b.rest[i - 1].delta_us_from_prev = (uint16_t)d;
    b.rest[i - 1].ax = batch_ax[i];
    b.rest[i - 1].ay = batch_ay[i];
    b.rest[i - 1].az = batch_az[i];
    b.rest[i - 1].gx = batch_gx[i];
    b.rest[i - 1].gy = batch_gy[i];
    b.rest[i - 1].gz = batch_gz[i];
    b.rest[i - 1].mx = IMU_MAG_INT16_NONE;
    b.rest[i - 1].my = IMU_MAG_INT16_NONE;
    b.rest[i - 1].mz = IMU_MAG_INT16_NONE;
  }

  if (imuOfflineCaptureActive()) {
    imuOfflineBatchPush(&b);
  } else if (use_tx_queue) {
#if ENABLE_IMU_DEDICATED_TASK
    if (imuBatchTxQueue == NULL ||
        xQueueSend(imuBatchTxQueue, &b, 0) != pdPASS) {
#if ENABLE_WIFI_SEND
      imuOfflineBatchPush(&b);
#else
      (void)b;
#endif
    }
#endif
  } else {
    imuTransmitBatchPacket(&b);
  }

  batch_fill = 0;
  if (!use_tx_queue) {
    yield();
  }
  return true;
}

#if ENABLE_IMU_DEDICATED_TASK
#if IMU_SAMPLE_ALIGN_MASTER_10MS_GRID
/**
 * Chờ tới mốc pha trên timeline master:
 * getGlobalTimeUs() % period == IMU_SAMPLE_GRID_PHASE_US (0 = biên lưới như cũ).
 */
static void imuDelayUntilNextMaster10msGrid(void) {
  if (!timeSynced) {
    return;
  }
  int64_t g64 = getGlobalTimeUs();
  if (g64 < 0) {
    return;
  }
  const uint64_t T = (uint64_t)IMU_LOOP_PERIOD_US;
  const uint64_t P = (uint64_t)IMU_SAMPLE_GRID_PHASE_US;
  const uint64_t g = (uint64_t)g64;
  const uint64_t r = g % T;
  uint64_t w;
  if (P == 0ULL) {
    w = (r == 0ULL) ? 0ULL : (T - r);
  } else {
    if (r < P) {
      w = P - r;
    } else if (r == P) {
      w = 0ULL;
    } else {
      w = T - r + P;
    }
  }
  if (w > T + T / 2U) {
    return;
  }
  if (w > 0ULL) {
    delayMicroseconds((uint32_t)w);
  }
}
#endif

static void imuSampleTask(void* arg) {
  (void)arg;
  TickType_t last = xTaskGetTickCount();
  const TickType_t period = pdMS_TO_TICKS(IMU_LOOP_PERIOD_US / 1000);
  for (;;) {
#if IMU_SAMPLE_ALIGN_MASTER_10MS_GRID
    if (!timeSynced) {
      vTaskDelayUntil(&last, period);
    } else {
      imuDelayUntilNextMaster10msGrid();
    }
#else
    vTaskDelayUntil(&last, period);
#endif
    (void)imuSampleProcessOne(true);
  }
}

static void imuDrainBatchTxQueue(void) {
  if (imuBatchTxQueue == NULL || syncRunning || !imuTxAttemptReady()) {
    return;
  }
  imu_batch_packet_t b;
  if (xQueueReceive(imuBatchTxQueue, &b, 0) == pdPASS) {
    imuTransmitBatchPacket(&b);
  }
}
#endif

// Trả về true nếu đã đọc được một mẫu IMU (chế độ loop cũ). Chế độ task: queue lỗi → fallback loop.
bool sendImuData() {
#if ENABLE_IMU_DEDICATED_TASK
  if (imuBatchTxQueue == NULL) {
    return imuSampleProcessOne(false);
  }
  return false;
#else
  return imuSampleProcessOne(false);
#endif
}

static void imuRetxRingStore(uint32_t seq, uint64_t micros, int16_t ax, int16_t ay, int16_t az,
                            int16_t gx, int16_t gy, int16_t gz,
                            int16_t mx, int16_t my, int16_t mz, int16_t temp_centi_c) {
  (void)mx;
  (void)my;
  (void)mz;
  size_t i = (size_t)(seq % IMU_RETX_RING_CAP);
  imu_retx_slot_t *s = &imuRetxRing[i];
  s->seq = seq;
  s->micros = micros;
  s->ax = ax;
  s->ay = ay;
  s->az = az;
  s->gx = gx;
  s->gy = gy;
  s->gz = gz;
  s->mx = IMU_MAG_INT16_NONE;
  s->my = IMU_MAG_INT16_NONE;
  s->mz = IMU_MAG_INT16_NONE;
  s->temp_centi_c = temp_centi_c;
}

static bool imuRetxRingGet(uint32_t seq, imu_retx_slot_t *out) {
  size_t i = (size_t)(seq % IMU_RETX_RING_CAP);
  if (imuRetxRing[i].seq == seq) {
    *out = imuRetxRing[i];
    return true;
  }
  return false;
}

static void imuRetxSendBatchFromSlots(const imu_retx_slot_t *blk, uint8_t n) {
  if (n < 1U || n > (uint8_t)IMU_BATCH_SAMPLES) {
    return;
  }
  imu_batch_packet_t b = {};
  memcpy(b.type, "IMU_RTXB", 8);
#if ESP_IDF_VERSION_MAJOR >= 5
  esp_wifi_get_mac(WIFI_IF_STA, b.mac);
#else
  esp_read_mac(b.mac, ESP_MAC_WIFI_STA);
#endif
  b.node_id = (uint32_t)(ESP.getEfuseMac() & 0xFFFFFF);
  b.count = n;
  b.sample_seq0 = blk[0].seq;
  b.micros_t0 = blk[0].micros;
  b.ax0 = blk[0].ax;
  b.ay0 = blk[0].ay;
  b.az0 = blk[0].az;
  b.gx0 = blk[0].gx;
  b.gy0 = blk[0].gy;
  b.gz0 = blk[0].gz;
  b.mx0 = IMU_MAG_INT16_NONE;
  b.my0 = IMU_MAG_INT16_NONE;
  b.mz0 = IMU_MAG_INT16_NONE;
  b.temp_centi_c = blk[n - 1U].temp_centi_c;
  for (uint8_t i = 1; i < n; i++) {
    uint64_t prev = blk[i - 1U].micros;
    uint64_t cur = blk[i].micros;
    uint64_t d = (cur >= prev) ? (cur - prev) : 0ULL;
    if (d > 65535ULL) {
      d = 65535ULL;
    }
    b.rest[i - 1U].delta_us_from_prev = (uint16_t)d;
    b.rest[i - 1U].ax = blk[i].ax;
    b.rest[i - 1U].ay = blk[i].ay;
    b.rest[i - 1U].az = blk[i].az;
    b.rest[i - 1U].gx = blk[i].gx;
    b.rest[i - 1U].gy = blk[i].gy;
    b.rest[i - 1U].gz = blk[i].gz;
    b.rest[i - 1U].mx = IMU_MAG_INT16_NONE;
    b.rest[i - 1U].my = IMU_MAG_INT16_NONE;
    b.rest[i - 1U].mz = IMU_MAG_INT16_NONE;
  }
  const size_t wire = IMU_BATCH_HEADER_SIZE + (size_t)(n - 1U) * sizeof(imu_batch_delta_t);
#if ENABLE_WIFI_SEND
  if (!imuStreamReady()) {
    return;
  }
#endif
#if ENABLE_IMU_TX_SLOT && ENABLE_WIFI_SEND
  waitUntilMyTxSlot();
#endif
#if ENABLE_WIFI_SEND
  const bool ok = espNowSendOnce(masterMAC, (uint8_t *)&b, wire);
  Serial.printf(
      "IMU_RETX,TX, seq0=%lu, n=%u, wire=%u, esp_ok=%d\n",
      (unsigned long)blk[0].seq, (unsigned)n, (unsigned)wire, ok ? 1 : 0);
  if (!ok) {
    espNowImuSendNotifyFail("ESP-NOW IMU_RETX failed", &b);
  } else {
    espNowImuSendNotifyOk();
  }
#endif
}

