caonam-tugraz/MultiIMU-GaitSync/firmware/slave_icm42688p/ESP32_ICM42688P_IMU.ino
static void imuHandleLostRequest(const imu_lost_request_t *rq) {
  uint8_t me[6];
#if ESP_IDF_VERSION_MAJOR >= 5
  esp_wifi_get_mac(WIFI_IF_STA, me);
#else
  esp_read_mac(me, ESP_MAC_WIFI_STA);
#endif
  if (memcmp(rq->target_mac, me, 6) != 0) {
    return;
  }
  const uint32_t our_node = (uint32_t)(ESP.getEfuseMac() & 0xFFFFFFU);
  if (rq->node_id != 0U && rq->node_id != our_node) {
    Serial.printf(
        "IMU_RETX,SKIP, node: req=%lu me=%lu\n", (unsigned long)rq->node_id,
        (unsigned long)our_node);
    return;
  }
  if (rq->seq_count == 0U) {
    Serial.println("IMU_RETX,SKIP, count=0");
    return;
  }
#if !ENABLE_WIFI_SEND
  Serial.println("IMU_RETX,SKIP, ENABLE_WIFI_SEND=0");
  return;
#else
  if (!connected) {
    Serial.println("IMU_RETX,SKIP, not connected to master");
    return;
  }
  if (!timeSynced) {
    Serial.println("IMU_RETX,SKIP, not time synced yet");
    return;
  }
  const uint32_t s0 = rq->seq_first;
  const uint32_t nc = rq->seq_count;
  Serial.printf(
      "IMU_RETX,START, seq %lu..%lu (n=%lu) node_id=%lu\n", (unsigned long)s0,
      (unsigned long)(s0 + nc - 1U), (unsigned long)nc, (unsigned long)our_node);

  imu_retx_slot_t block[IMU_BATCH_SAMPLES];
  uint8_t nfill = 0;
  uint32_t n_hit = 0;
  uint32_t n_miss = 0;
  for (uint32_t k = 0; k < nc; k++) {
    const uint32_t sseq = s0 + k;
    imu_retx_slot_t one;
    if (!imuRetxRingGet(sseq, &one)) {
      n_miss++;
      if (nfill > 0) {
        imuRetxSendBatchFromSlots(block, nfill);
        nfill = 0;
      }
      continue;
    }
    n_hit++;
    if (nfill > 0 && one.seq != (uint32_t)block[nfill - 1U].seq + 1U) {
      imuRetxSendBatchFromSlots(block, nfill);
      nfill = 0;
    }
    block[nfill++] = one;
    if (nfill == (uint8_t)IMU_BATCH_SAMPLES) {
      imuRetxSendBatchFromSlots(block, nfill);
      nfill = 0;
    }
  }
  if (nfill > 0) {
    imuRetxSendBatchFromSlots(block, nfill);
  }
  Serial.printf(
      "IMU_RETX,DONE, in_ring=%lu, not_in_buffer=%lu (req n=%lu)\n",
      (unsigned long)n_hit, (unsigned long)n_miss, (unsigned long)nc);
#endif
}

// ======================== RECV ========================
static void syncSkipLogRttHigh(int64_t rttUs) {
  static uint32_t s_lastLogMs = 0;
  const uint32_t now = millis();
  if (s_lastLogMs != 0U && (uint32_t)(now - s_lastLogMs) < 3000U) {
    return;
  }
  s_lastLogMs = now;
  Serial.printf("SYNC: bo qua — RTT %lld us >= %lld us\n", (long long)rttUs,
                (long long)SYNC_ACCEPT_MAX_RTT_US);
}

static void syncRoundFinish(int64_t bestOff, int64_t bestRtt, int timezone,
                            uint64_t t3, uint64_t t4) {
  const int64_t prevOffset = globalTimeOffset;

  globalTimeOffset = bestOff;
  globalTimeOffsetTarget = bestOff;
  networkDelayUs = bestRtt / 2;
  timeSynced = true;
  timezoneOffset = timezone;
#if ENABLE_WIFI_SEND
  imuTxFailStreak = 0;
  syncLastSendOk = true;
  imuTxNextAttemptMs = 0;
#endif

  lastCompletedSyncBestRttUs =
      (bestRtt > (int64_t)UINT32_MAX) ? UINT32_MAX : (uint32_t)bestRtt;

  Serial.printf(
      "SYNC DONE | RTT=%lld us (< %lld us) | delay~%lld us | offset=%lld us "
      "| prev_offset=%lld us | delta=%lld us\n",
      (long long)bestRtt, (long long)SYNC_ACCEPT_MAX_RTT_US,
      (long long)networkDelayUs, (long long)globalTimeOffset,
      (long long)prevOffset, (long long)(globalTimeOffset - prevOffset));

  {
    const uint64_t slv_now = nowUs();
    Serial.printf(
        "SYNC_CLOCK master_t3_us=%llu slave_t4_rx_us=%llu slave_local_now_us=%llu\n",
        (unsigned long long)t3, (unsigned long long)t4,
        (unsigned long long)slv_now);

    if (syncPrevDriftSampleValid) {
      const uint64_t d_local = slv_now - syncPrevDriftLocalUs;
      const int64_t d_offset = bestOff - syncPrevDriftOffsetUs;
      const double ppm = (d_local >= SYNC_DRIFT_MIN_SPAN_US)
                             ? ((double)d_offset * 1e6 / (double)d_local)
                             : 0.0;
      const bool have_drift_span = (d_local >= SYNC_DRIFT_MIN_SPAN_US);
      const bool ppm_ok =
          have_drift_span && (fabs(ppm) <= SYNC_DRIFT_MAX_ABS_PPM);
      if (ppm_ok) {
        if (!syncDriftFilteredValid) {
          syncDriftFilteredPpm = ppm;
          syncDriftFilteredValid = true;
        } else {
          syncDriftFilteredPpm =
              syncDriftFilteredPpm * (1.0 - SYNC_DRIFT_FILTER_ALPHA) +
              ppm * SYNC_DRIFT_FILTER_ALPHA;
        }
        if (syncDriftAcceptedCount < 255U) {
          syncDriftAcceptedCount++;
        }
        syncDriftRecentAdd(ppm);
        maybeSaveStableSyncDriftToNvs();
      }
      Serial.printf(
          "SYNC_DRIFT_OFFSET: d_local_us=%llu d_offset_us=%lld "
          "raw_ppm=%.3f accepted=%d filtered_ppm=%.3f accepted_count=%u comp=%d "
          "(offset increases when slave clock is slower)\n",
          (unsigned long long)d_local, (long long)d_offset, ppm,
          ppm_ok ? 1 : 0,
          syncDriftFilteredValid ? syncDriftFilteredPpm : 0.0,
          (unsigned)syncDriftAcceptedCount,
#if SYNC_DRIFT_COMP_ENABLE
          (syncDriftFilteredValid &&
           syncDriftAcceptedCount >= (uint8_t)SYNC_DRIFT_COMP_MIN_ACCEPTED)
              ? 1
              : 0);
#else
          0);
#endif
    }
    syncPrevDriftLocalUs = slv_now;
    syncPrevDriftOffsetUs = bestOff;
    syncPrevDriftSampleValid = true;
    syncDriftAnchorLocalUs = slv_now;
    syncDriftLastCompMs = millis();
  }

  syncRunning = false;
  lastSyncTime = millis();
  syncPeriodicIntervalBumpAfterDone();
}

void onDataRecv(const esp_now_recv_info *info, const uint8_t *incomingData, int len) {
  if (info != nullptr && info->rx_ctrl != nullptr) {
    g_slaveLastRxRssiDb = info->rx_ctrl->rssi;
    g_slaveLastRxRssiValid = 1U;
#if SLAVE_WIFI_TX_POWER_ADAPTIVE
    slaveWifiTxPowerUpdateFromRssi(info->rx_ctrl->rssi);
#endif
  }

  if (len == (int)IMU_LOST_REQUEST_SIZE) {
    imu_lost_request_t lq;
    memcpy(&lq, incomingData, sizeof(lq));
    if (memcmp(lq.type, "IMU_LOST", 8) == 0) {
      imuHandleLostRequest(&lq);
      return;
    }
  }

  const int calibFull = (int)sizeof(accel_calib_packet_t);
  if (len == calibFull || len == ACCEL_CALIB_PACKET_LEGACY_SIZE) {
    const bool fullPkt = (len == calibFull);
    accel_calib_packet_t calibPkt = {};
    memcpy(&calibPkt, incomingData, (size_t)(fullPkt ? calibFull : ACCEL_CALIB_PACKET_LEGACY_SIZE));

    /* Master gửi CALGET → trả về thông số đang dùng (RAM/NVS), không đổi NVS. */
    if (strcmp(calibPkt.type, "CALGET") == 0) {
      if (!fullPkt) {
        return;
      }
      accel_calib_packet_t out = {};
      strcpy(out.type, "CALREP");
#if ESP_IDF_VERSION_MAJOR >= 5
      esp_wifi_get_mac(WIFI_IF_STA, out.mac);
#else
      esp_read_mac(out.mac, ESP_MAC_WIFI_STA);
#endif
      out.node_id = (uint32_t)(ESP.getEfuseMac() & 0xFFFFFF);
      out.timestamp = nowMs();
      out.micros_timestamp = nowUs();
      out.bias[0] = accelBias[0];
      out.bias[1] = accelBias[1];
      out.bias[2] = accelBias[2];
      out.scale[0] = accelScale[0];
      out.scale[1] = accelScale[1];
      out.scale[2] = accelScale[2];
      out.global_scale = accelGlobalScale;
      out.save_to_nvs = 0;
      out.enabled = accelCalibEnabled ? 1 : 0;
      out.gyro_bias[0] = gyroBias[0];
      out.gyro_bias[1] = gyroBias[1];
      out.gyro_bias[2] = gyroBias[2];
#if ENABLE_WIFI_SEND
      esp_now_send(masterMAC, (uint8_t *)&out, sizeof(out));
#endif
      Serial.printf(
          "CALGET_TX,%s,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f\n",
          accelCalibEnabled ? "ENABLED" : "DISABLED",
          accelBias[0], accelBias[1], accelBias[2],
          accelScale[0], accelScale[1], accelScale[2],
          accelGlobalScale,
          gyroBias[0], gyroBias[1], gyroBias[2]);
      return;
    }

