caonam-tugraz/MultiIMU-GaitSync/firmware/slave_icm42688p/ESP32_ICM42688P_IMU.ino
    if (strcmp(calibPkt.type, "CALIB") == 0) {
      if (calibPkt.enabled != 0) {
        accelBias[0] = calibPkt.bias[0];
        accelBias[1] = calibPkt.bias[1];
        accelBias[2] = calibPkt.bias[2];
        accelScale[0] = calibPkt.scale[0];
        accelScale[1] = calibPkt.scale[1];
        accelScale[2] = calibPkt.scale[2];
        accelGlobalScale = calibPkt.global_scale;
        accelCalibEnabled = true;
        if (fullPkt) {
          gyroBias[0] = calibPkt.gyro_bias[0];
          gyroBias[1] = calibPkt.gyro_bias[1];
          gyroBias[2] = calibPkt.gyro_bias[2];
        }
      } else {
        resetAccelCalibration();
      }

      bool saveOk = true;
      if (calibPkt.save_to_nvs != 0) {
        saveOk = saveAccelCalibrationToNvs();
      }

      Serial.printf(
          "CALIB_RX,%s,%s,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f\n",
          saveOk ? "OK" : "FAIL",
          accelCalibEnabled ? "ENABLED" : "DISABLED",
          accelBias[0], accelBias[1], accelBias[2],
          accelScale[0], accelScale[1], accelScale[2],
          accelGlobalScale,
          gyroBias[0], gyroBias[1], gyroBias[2]);
      sendCalibAck(saveOk);
      return;
    }
  }

  if (len < (int)PACKET_T_LEGACY_SIZE) {
    return;
  }

  packet_t pkt = {};
  memcpy(&pkt, incomingData, (size_t)len);
  if (len < (int)sizeof(packet_t)) {
    pkt.imu_tx_slot = MASTER_SLOT_UNASSIGNED;
    pkt.sync_slot = MASTER_SLOT_UNASSIGNED;
    pkt.slot_flags = 0;
  }

  if (strcmp(pkt.type, "ACK") == 0) {
#if ENABLE_IMU_TX_SLOT
    applyMasterSlotFromPacket(&pkt);
#endif
#if ENABLE_WIFI_SEND
    espnowTxResult = 0;
#endif
    touchMasterLink();
    return;
  }

#if SLAVE_SYNC_MASTER_DRIVEN
  if (strcmp(pkt.type, "TSRQ") == 0) {
    slaveStartSyncFromMasterRequest();
    return;
  }
#endif

  if (strcmp(pkt.type, "TIME") == 0) {
    touchMasterLink();
#if ENABLE_IMU_TX_SLOT
    applyMasterSlotFromPacket(&pkt);
#endif
    uint64_t t4 = nowUs();

    uint64_t t1 = pkt.request_time;
    uint64_t t2 = pkt.micros_timestamp;
    uint64_t t3 = pkt.response_time;

    if (!(t4 >= t1 && t3 >= t2)) {
      return;
    }

    int64_t rtt = (int64_t)((t4 - t1) - (t3 - t2));
    if (rtt <= 0) return;

    /* Master chỉ gửi TIME sau SYNC của slave — chỉ xử lý trong vòng đồng bộ. */
    if (!syncRunning) {
      return;
    }

    if (rtt >= SYNC_ACCEPT_MAX_RTT_US) {
      syncSkipLogRttHigh(rtt);
      return;
    }

    const int64_t offset =
        ((int64_t)t2 - (int64_t)t1 + (int64_t)t3 - (int64_t)t4) / 2;

    syncRoundFinish(offset, rtt, pkt.timezone_offset, t3, t4);
  }
}

static const char* imuAccelFsLabel(uint8_t v) {
  switch (v) {
    case 0x00: return "±16 g";
    case 0x01: return "±8 g";
    case 0x02: return "±4 g";
    case 0x03: return "±2 g";
    default: return "?";
  }
}

static const char* imuGyroFsLabel(uint8_t v) {
  switch (v) {
    case 0x00: return "±2000 °/s";
    case 0x01: return "±1000 °/s";
    case 0x02: return "±500 °/s";
    case 0x03: return "±250 °/s";
    case 0x04: return "±125 °/s";
    case 0x05: return "±62.5 °/s";
    case 0x06: return "±31.25 °/s";
    case 0x07: return "±15.625 °/s";
    default: return "?";
  }
}

static const char* imuOdrLabel(uint8_t v) {
  switch (v) {
    case 0x01: return "32 kHz";
    case 0x02: return "16 kHz";
    case 0x03: return "8 kHz";
    case 0x04: return "4 kHz";
    case 0x05: return "2 kHz";
    case 0x06: return "1 kHz";
    case 0x07: return "200 Hz";
    case 0x08: return "100 Hz";
    case 0x09: return "50 Hz";
    case 0x0A: return "25 Hz";
    case 0x0B: return "12.5 Hz";
    case 0x0C: return "6.25 Hz (LP)";
    case 0x0D: return "3.125 Hz (LP)";
    case 0x0E: return "1.5625 Hz (LP)";
    case 0x0F: return "500 Hz";
    default: return "?";
  }
}

// Đọc 1 byte thanh ghi (USER BANK 0) — cùng bus I2C với ICM42688
static bool imuReadRegBank0(uint8_t reg, uint8_t* out) {
  using namespace ICM42688reg;
  Wire.beginTransmission(ICM42688_ADDR);
  Wire.write(REG_BANK_SEL);
  Wire.write(0);
  if (Wire.endTransmission() != 0) return false;

  Wire.beginTransmission(ICM42688_ADDR);
  Wire.write(reg);
  if (Wire.endTransmission(false) != 0) return false;
  if (Wire.requestFrom((int)ICM42688_ADDR, 1) != 1) return false;
  *out = Wire.read();
  return true;
}

static void printImuConfigToSerial() {
  uint8_t af = (uint8_t)IMU_ACCEL_FS;
  uint8_t gf = (uint8_t)IMU_GYRO_FS;
  uint8_t ao = (uint8_t)IMU_ACCEL_ODR;
  uint8_t go = (uint8_t)IMU_GYRO_ODR;
  Serial.println("IMU config (macros → setAccel/Gyro*):");
  Serial.printf("  Accel FS: %s (enum 0x%02X)\n", imuAccelFsLabel(af), af);
  Serial.printf("  Gyro FS:  %s (enum 0x%02X)\n", imuGyroFsLabel(gf), gf);
  Serial.printf("  Accel ODR: %s (enum 0x%02X)\n", imuOdrLabel(ao), ao);
  Serial.printf("  Gyro ODR:  %s (enum 0x%02X)\n", imuOdrLabel(go), go);

  uint8_t accelCfg = 0, gyroCfg = 0;
  using namespace ICM42688reg;
  if (!imuReadRegBank0(UB0_REG_ACCEL_CONFIG0, &accelCfg) ||
      !imuReadRegBank0(UB0_REG_GYRO_CONFIG0, &gyroCfg)) {
    Serial.println("IMU readback (chip): I2C read ACCEL_CONFIG0 / GYRO_CONFIG0 failed");
    return;
  }
  uint8_t afs = (accelCfg >> 5) & 0x07;
  uint8_t aos = accelCfg & 0x0F;
  uint8_t gfs = (gyroCfg >> 5) & 0x07;
  uint8_t gos = gyroCfg & 0x0F;
  Serial.println("IMU readback (chip registers):");
  Serial.printf("  ACCEL_CONFIG0 0x%02X: raw=0x%02X | FS=%s | ODR=%s\n",
                UB0_REG_ACCEL_CONFIG0, accelCfg,
                imuAccelFsLabel(afs), imuOdrLabel(aos));
  Serial.printf("  GYRO_CONFIG0  0x%02X: raw=0x%02X | FS=%s | ODR=%s\n",
                UB0_REG_GYRO_CONFIG0, gyroCfg,
                imuGyroFsLabel(gfs), imuOdrLabel(gos));
}

// ======================== SETUP ========================
void setup() {
  Serial.begin(921600);
  delay(200);

  Serial.println("\n=== ESP-NOW TIME SYNC SLAVE ICM42688 ===");

  pinMode(PULSE_PIN, OUTPUT);
  digitalWrite(PULSE_PIN, LOW);

  pinMode(LED_PIN, OUTPUT);
  digitalWrite(LED_PIN, LOW);

  analogReadResolution(12);
  analogSetPinAttenuation(VBAT_ADC_PIN, ADC_11db);
  Serial.printf(
      "VBAT ADC: GPIO%u, MA=%u mau, ~%.1f Hz (moi %lums)\n",
      (unsigned)VBAT_ADC_PIN, (unsigned)VBAT_ADC_MA_N,
      1000.0f / (float)VBAT_ADC_SAMPLE_PERIOD_MS,
      (unsigned long)VBAT_ADC_SAMPLE_PERIOD_MS);

  Serial.printf("Pulse pin D%d HIGH during IMU read, LOW before packet handling\n", PULSE_PIN);
  Serial.printf(
      "IMU ESP-NOW: %u samples/batch (~%u pkt/s @ ~%lu Hz loop)\n",
      (unsigned)IMU_BATCH_SAMPLES,
      (unsigned)((1000000UL / IMU_LOOP_PERIOD_US) / IMU_BATCH_SAMPLES),
      (unsigned long)(1000000UL / IMU_LOOP_PERIOD_US));
#if ENABLE_WIFI_SEND
  Serial.println("ESP-NOW send: ON");
#else
  Serial.println("ESP-NOW send: OFF");
#endif
#if SERIAL_IMU_OUTPUT
  Serial.println("Serial IMU output: ON");
#else
  Serial.println("Serial IMU output: OFF");
#endif

