caonam-tugraz/MultiIMU-GaitSync/firmware/slave_icm42688p/ESP32_ICM42688P_IMU.ino
  // ---- IMU init ----
  Wire.begin(SDA_PIN, SCL_PIN);
  Wire.setClock(400000);
  delay(500);

  int status = IMU.begin();
  if (status < 0) {
    Serial.printf("ICM42688 init failed! status=%d\n", status);
    while (1) delay(1000);
  }

  IMU.setAccelFS(IMU_ACCEL_FS);
  IMU.setGyroFS(IMU_GYRO_FS);
  IMU.setAccelODR(IMU_ACCEL_ODR);
  IMU.setGyroODR(IMU_GYRO_ODR);
  printImuConfigToSerial();

  Serial.println("ICM42688 ready (raw accel/gyro, mag=0)");
  loadAccelCalibrationFromNvs();
  loadSyncDriftFromNvs();
#if SYNC_DRIFT_COMP_ENABLE
  Serial.printf(
      "Drift comp: ON | fold every %lu ms | min accepted=%u | filter alpha=%.2f\n",
      (unsigned long)SYNC_DRIFT_COMP_INTERVAL_MS,
      (unsigned)SYNC_DRIFT_COMP_MIN_ACCEPTED, SYNC_DRIFT_FILTER_ALPHA);
#else
  Serial.println("Drift comp: OFF");
#endif

  // ---- Radio ----
  setupRadio();

  uint8_t mac[6];
#if ESP_IDF_VERSION_MAJOR >= 5
  esp_wifi_get_mac(WIFI_IF_STA, mac);
#else
  esp_read_mac(mac, ESP_MAC_WIFI_STA);
#endif

  Serial.print("Slave MAC: ");
  printMAC(mac);
  Serial.println();
  Serial.println("----------------------------------");

  // ---- ESP-NOW ----
  if (esp_now_init() != ESP_OK) {
    Serial.println("ESP-NOW init failed!");
    return;
  }

  esp_now_register_recv_cb(onDataRecv);
#if ENABLE_WIFI_SEND
  esp_now_register_send_cb(onEspNowSendCb);
#endif

  if (!addMasterPeer()) {
    Serial.println("Add master peer failed!");
    return;
  }

  Serial.print("Master MAC: ");
  printMAC(masterMAC);
  Serial.println(" OK");

  Serial.println("Slave ready, trying to connect to master...");
  printTime();

#if ENABLE_IMU_DEDICATED_TASK
  imuBatchTxQueue = xQueueCreate(IMU_BATCH_QUEUE_DEPTH, sizeof(imu_batch_packet_t));
  if (imuBatchTxQueue == NULL) {
    Serial.println(
        "IMU: xQueueCreate failed — dùng loop() đọc IMU (không task).");
  } else {
    BaseType_t ok = xTaskCreatePinnedToCore(
        imuSampleTask, "imu100", IMU_SAMPLE_TASK_STACK, NULL, IMU_SAMPLE_TASK_PRIO,
        &imuSampleTaskHandle, IMU_SAMPLE_TASK_CORE);
    if (ok != pdPASS) {
      Serial.println("IMU: xTaskCreatePinnedToCore failed — queue delete, fallback loop.");
      vQueueDelete(imuBatchTxQueue);
      imuBatchTxQueue = NULL;
    } else {
#if IMU_SAMPLE_ALIGN_MASTER_10MS_GRID
      Serial.printf(
          "IMU: task ~100 Hz on core %d (queue %d); sau sync: grid period=%u us, "
          "sample_phase=%u us (0=on boundary)\n",
          IMU_SAMPLE_TASK_CORE, IMU_BATCH_QUEUE_DEPTH,
          (unsigned)IMU_LOOP_PERIOD_US, (unsigned)IMU_SAMPLE_GRID_PHASE_US);
#else
      Serial.printf(
          "IMU: task 100 Hz on core %d (queue depth %d)\n",
          IMU_SAMPLE_TASK_CORE, IMU_BATCH_QUEUE_DEPTH);
#endif
    }
  }
#endif

  delay(1000);
  sendHello();
}

// ======================== LOOP ========================
void loop() {
  vbatAdcPoll();
  const uint8_t batPct = adcRawToBatteryPct(readVbatAdcRaw());
  if (lowBatteryCrit) {
    const unsigned long m = millis() % VBAT_LOW_LED_CYCLE_MS;
    digitalWrite(LED_PIN, (m >= VBAT_LOW_LED_OFF_MS) ? HIGH : LOW);
    yield();
    delay(1);
    return;
  }
  if (batPct < VBAT_LOW_PCT_ENTER) {
    enterLowBatteryCritMode();
    return;
  }

#if !SLAVE_SYNC_MASTER_DRIVEN
  if (connected && !syncRunning && !timeSynced) {
    const unsigned long nowMs = millis();
    const unsigned long needGap =
        (lastSyncTime == 0U) ? 0UL : (unsigned long)SYNC_RETRY_AFTER_FAIL_MS;
    const unsigned long sinceLast =
        (lastSyncTime == 0U) ? needGap : (unsigned long)(nowMs - lastSyncTime);
    if (sinceLast >= needGap) {
      if (slaveRssiTooWeakForSync()) {
        slaveSyncSkipLogRssiWeak();
      } else {
        syncRunning = true;
#if ENABLE_WIFI_SEND
        sendSyncRequest();
#endif
        lastSyncSampleSentMs = nowMs;
        Serial.println("Starting SYNC (require TIME before IMU)...");
      }
    }
  }

  if (connected && !syncRunning && timeSynced &&
      (millis() - lastSyncTime > syncPeriodicMinGapMs()) &&
      syncPeriodicSlotReady()) {
    if (slaveRssiTooWeakForSync()) {
      slaveSyncSkipLogRssiWeak();
    } else {
      syncRunning = true;
      lastSyncSampleSentMs = millis() - (unsigned long)SYNC_SAMPLE_GAP_MS;
      Serial.printf("Starting SYNC (%lu ms + MAC slot %u, offset %lu ms)...\n",
                    (unsigned long)syncPeriodicIntervalMs,
                    (unsigned)syncPeriodicMacSlotIndex(),
                    (unsigned long)syncPeriodicSlotOffsetMs());
    }
  }

  if (connected && syncRunning) {
    if (slaveRssiTooWeakForSync()) {
      syncRunning = false;
      slaveSyncSkipLogRssiWeak();
    } else {
      const unsigned long syncGap =
          syncLastSendOk ? (unsigned long)SYNC_SAMPLE_GAP_MS
                         : (unsigned long)SYNC_FAIL_BACKOFF_GAP_MS;
      if (millis() - lastSyncSampleSentMs >= syncGap) {
        sendSyncRequest();
        lastSyncSampleSentMs = millis();
      }
    }
  }
#endif

  bool imuSent = false;
  uint64_t loopStartUsForDelay = 0;
#if ENABLE_IMU_DEDICATED_TASK
  if (imuBatchTxQueue != NULL) {
    if (!syncRunning) {
      imuDrainBatchTxQueue();
    }
    static uint32_t lastSeenImuPacketCount = 0;
    imuSent = (imuPacketCount != lastSeenImuPacketCount);
    lastSeenImuPacketCount = imuPacketCount;
  } else if (!syncRunning) {
    loopStartUsForDelay = nowUs();
    imuSent = sendImuData();
  }
#else
  if (!syncRunning) {
    loopStartUsForDelay = nowUs();
    imuSent = sendImuData();
  }
#endif

  if (ledOffAt > 0 && millis() >= ledOffAt) {
    digitalWrite(LED_PIN, LOW);
    ledOffAt = 0;
  }

  if (connected && (millis() - lastAckTime > CONNECTION_TIMEOUT_MS)) {
    disconnectFromMaster("Lost connection to master (ACK timeout), reconnecting...");
  }

  if (!connected) {
    unsigned long t = millis();
    bool noMaster = !hasEverConnected ||
                    (hasEverConnected && disconnectedSince > 0 &&
                     (t - disconnectedSince > NO_MASTER_THRESHOLD));

    unsigned long cycle = noMaster ? LED_NO_MASTER_CYCLE : LED_RECONNECT_CYCLE;
    unsigned long pos = t % cycle;

    if (noMaster) {
      digitalWrite(LED_PIN, (pos < 50) ? HIGH : LOW);
    } else {
      bool on = (pos < LED_FLASH_MS) || (pos >= 125 && pos < 125 + LED_FLASH_MS);
      digitalWrite(LED_PIN, on ? HIGH : LOW);
    }
  }

  if (!connected && (millis() - lastHelloTime > HELLO_RECONNECT_INTERVAL)) {
    sendHello();
  }

#if HELLO_KEEPALIVE_INTERVAL > 0
  if (connected && (millis() - lastHelloTime > HELLO_KEEPALIVE_INTERVAL)) {
    sendHello();
  }
#endif

  syncDriftPeriodicService();

  if (imuSent && connected && timeSynced && imuPacketCount > 0 &&
      (imuPacketCount % 10 == 0)) {
    digitalWrite(LED_PIN, HIGH);
    ledOffAt = millis() + LED_FLASH_MS;
  }

#if ENABLE_WIFI_SEND
  if (connected && !syncRunning) {
    drainImuOfflineQueue();
    imuLowRssiService();
  }
#endif

  yield();

#if !ENABLE_IMU_DEDICATED_TASK
  /*
   * Chu kỳ vòng lặp ≈ IMU_LOOP_PERIOD_US (10 ms) → ~100 Hz mẫu IMU.
   * Nếu elapsedUs >= IMU_LOOP_PERIOD_US (SYNC nặng, drain/TX lâu) thì không delay.
   */
  {
    uint64_t elapsedUs = nowUs() - loopStartUsForDelay;
    if (elapsedUs < IMU_LOOP_PERIOD_US) {
      delayMicroseconds((uint32_t)(IMU_LOOP_PERIOD_US - elapsedUs));
    }
  }
#else
  if (imuBatchTxQueue == NULL) {
    uint64_t elapsedUs = nowUs() - loopStartUsForDelay;
    if (elapsedUs < IMU_LOOP_PERIOD_US) {
      delayMicroseconds((uint32_t)(IMU_LOOP_PERIOD_US - elapsedUs));
    }
  }
#endif
}